return {
	game_main=
	{
		[1]=
		{
			id = 1,
			cn = "%s 正在更新中 (0 / 100)…",
			bn = [[%s Sedang update(0/100)…]],
		},
		[2]=
		{
			id = 2,
			cn = "%s 正在更新中 (%d / 100)…",
			bn = [[%s Sedang update(%d/100)…]],
		},
		[1000]=
		{
			id = 1000,
			cn = "调用失败， 未找到服务",
			bn = [[Panggilan gagal,layanan tidak ditemukan]],
		},
		[1001]=
		{
			id = 1001,
			cn = "参数错误",
			bn = [[Kesalahan parameter]],
		},
		[1002]=
		{
			id = 1002,
			cn = "当前无法进行此操作",
			bn = [[Saat ini tidak dapat melakukan tindakan ini]],
		},
		[1003]=
		{
			id = 1003,
			cn = "数据不合法",
			bn = [[Data ilegal]],
		},
		[1004]=
		{
			id = 1004,
			cn = "数据不存在",
			bn = [[Data tidak ada]],
		},
		[1005]=
		{
			id = 1005,
			cn = "已在当前游戏或者其他游戏当中",
			bn = [[Telah berada di game saat ini atau game lainnya]],
		},
		[1006]=
		{
			id = 1006,
			cn = "未知的资源类型， 无法创建新服务",
			bn = [[Jenis resource tidak dikenal, tidak dapat membuat layanan baru]],
		},
		[1007]=
		{
			id = 1007,
			cn = "系统资源不足， 无法创建新服务",
			bn = [[Resource sistem tidak mencukupi, tidak dapat membuat layanan baru]],
		},
		[1008]=
		{
			id = 1008,
			cn = "系统繁忙",
			bn = [[Sistem sedang sibuk]],
		},
		[1009]=
		{
			id = 1009,
			cn = "系统即将进行维护， 请稍后再试",
			bn = [[Sistem dalam maintenance,  silakan coba lagi nanti]],
		},
		[1010]=
		{
			id = 1010,
			cn = "数据服务内部错误",
			bn = [[Kesalahan internal layanan data]],
		},
		[1011]=
		{
			id = 1011,
			cn = "钻石数量不满足要求",
			bn = [[1011]],
		},
		[1012]=
		{
			id = 1012,
			cn = "需要的物品数量异常",
			bn = [[1012]],
		},
		[1013]=
		{
			id = 1013,
			cn = "现金数量不满足要求",
			bn = [[1013]],
		},
		[1014]=
		{
			id = 1014,
			cn = "vip等级不满足要求",
			bn = [[1014]],
		},
		[1022]=
		{
			id = 1022,
			cn = "复活卡数量不满足要求",
			bn = [[1022]],
		},
		[1023]=
		{
			id = 1023,
			cn = "金币数量不满足要求",
			bn = [[1023]],
		},
		[1024]=
		{
			id = 1024,
			cn = "福利券数量不足",
			bn = [[1024]],
		},
		[1025]=
		{
			id = 1025,
			cn = "代币数量不足",
			bn = [[1025]],
		},
		[1026]=
		{
			id = 1026,
			cn = "房卡数量不足",
			bn = [[1026]],
		},
		[1027]=
		{
			id = 1027,
			cn = "资阳城市杯海选门票数量不足",
			bn = [[1027]],
		},
		[1028]=
		{
			id = 1028,
			cn = "资阳城市杯复赛门票数量不足",
			bn = [[1028]],
		},
		[1029]=
		{
			id = 1029,
			cn = "资阳城市杯决赛门票数量不足",
			bn = [[1029]],
		},
		[1031]=
		{
			id = 1031,
			cn = "客户端请求太频繁",
			bn = [[Permintaan client terlalu sering]],
		},
		[1032]=
		{
			id = 1032,
			cn = "客户端 login 不是第一个请求",
			bn = [[Login client bukan permintaan pertama]],
		},
		[1033]=
		{
			id = 1033,
			cn = "login id 不能是 robot 前缀",
			bn = [[ID login tidak boleh berupa robot prefix]],
		},
		[1034]=
		{
			id = 1034,
			cn = "客户端初始消息名不正确",
			bn = [[Nama pesan awal Client salah]],
		},
		[1035]=
		{
			id = 1035,
			cn = "还未登录",
			bn = [[Belum Login]],
		},
		[1036]=
		{
			id = 1036,
			cn = "此用户的另一个验证操作正在执行中",
			bn = [[Tindakan verifikasi lain untuk user ini sedang berlangsung]],
		},
		[1037]=
		{
			id = 1037,
			cn = "此用户已经被另一个设备创建",
			bn = [[User ini telah digunakan di perangkat lain]],
		},
		[1038]=
		{
			id = 1038,
			cn = "此用户正在另一个设备上创建",
			bn = [[User ini sedang digunakan di perangkat lain]],
		},
		[1039]=
		{
			id = 1039,
			cn = "此登录渠道已关闭",
			bn = [[Saluran Login ini ditutup]],
		},
		[1040]=
		{
			id = 1040,
			cn = "您正在游戏中， 不能登出",
			bn = [[Anda sedang berada di dalam game dan tidak dapat Logout]],
		},
		[1041]=
		{
			id = 1041,
			cn = "当前网络不稳定，如多次无法登录请联系客服。",
			bn = [[Jaringan saat ini tidak stabil, jika Anda tidak dapat login berkali-kali, silakan hubungi CS.]],
		},
		[1042]=
		{
			id = 1042,
			cn = "自动登录信息过期， 需要重新验证",
			bn = [[Info Login otomatis kedaluwarsa,  perlu verifikasi ulang]],
		},
		[1043]=
		{
			id = 1043,
			cn = "自动登录用户不存在， 需要注册",
			bn = [[User Login otomatis tidak ada,  perlu mendaftar]],
		},
		[1044]=
		{
			id = 1044,
			cn = "自动登录信息无效， 需要重新验证",
			bn = [[Info Login otomatis tidak valid,  perlu verifikasi ulang]],
		},
		[1051]=
		{
			id = 1051,
			cn = "重复调用功能",
			bn = [[Ulangi fitur panggilan]],
		},
		[1052]=
		{
			id = 1052,
			cn = "数据验证失败",
			bn = [[Verifikasi data gagal]],
		},
		[1053]=
		{
			id = 1053,
			cn = "服务器内部错误",
			bn = [[Kesalahan internal server]],
		},
		[1054]=
		{
			id = 1054,
			cn = "不必要的操作",
			bn = [[Tindakan yang tidak perlu]],
		},
		[1055]=
		{
			id = 1055,
			cn = "该项目已经属于其他实体",
			bn = [[Proyek ini telah menjadi milik entitas lain]],
		},
		[1056]=
		{
			id = 1056,
			cn = "玩家状态被锁定",
			bn = [[Status pemain terkunci]],
		},
		[1057]=
		{
			id = 1057,
			cn = "用户不是高级合伙人",
			bn = [[1057]],
		},
		[1058]=
		{
			id = 1058,
			cn = "用户类型不正确",
			bn = [[1058]],
		},
		[1059]=
		{
			id = 1059,
			cn = "JSON数据解析错误",
			bn = [[1059]],
		},
		[1060]=
		{
			id = 1060,
			cn = "数据不匹配",
			bn = [[1060]],
		},
		[1061]=
		{
			id = 1061,
			cn = "没找到查询的数据",
			bn = [[1061]],
		},
		[1062]=
		{
			id = 1062,
			cn = "必须提供财富类型",
			bn = [[1062]],
		},
		[1063]=
		{
			id = 1063,
			cn = "此操作不能同时进行多个",
			bn = [[Tindakan ini tidak dapat dilakukan lebih dari satu kali secara bersamaan]],
		},
		[1064]=
		{
			id = 1064,
			cn = "服务器对象正在销毁",
			bn = [[Objek server sedang dihancurkan]],
		},
		[1065]=
		{
			id = 1065,
			cn = "服务器对象不存在",
			bn = [[Objek server tidak ada]],
		},
		[1066]=
		{
			id = 1066,
			cn = "此ID对应的服务已经存在",
			bn = [[Layanan yang sesuai dengan ID ini sudah ada]],
		},
		[1067]=
		{
			id = 1067,
			cn = "此ID对应的服务已经存在或正在创建",
			bn = [[Layanan yang sesuai dengan ID ini sudah ada atau sedang digunakan]],
		},
		[1068]=
		{
			id = 1068,
			cn = "服务器即将关闭， 不允许此操作",
			bn = [[Server akan ditutup,  tindakan ini tidak diperbolehkan]],
		},
		[1069]=
		{
			id = 1069,
			cn = "操作太频繁， 请稍后再试",
			bn = [[Tindakan ini terlalu sering,  silakan coba lagi nanti]],
		},
		[1070]=
		{
			id = 1070,
			cn = "登录渠道不存在",
			bn = [[1070]],
		},
		[1071]=
		{
			id = 1071,
			cn = "玩家登录id不存在",
			bn = [[1071]],
		},
		[1072]=
		{
			id = 1072,
			cn = "平台不存在玩家id",
			bn = [[1072]],
		},
		[1073]=
		{
			id = 1073,
			cn = "目标玩家不可被绑定",
			bn = [[1073]],
		},
		[1074]=
		{
			id = 1074,
			cn = "您已经有上级了",
			bn = [[1074]],
		},
		[1075]=
		{
			id = 1075,
			cn = "您输入的邀请码错误",
			bn = [[1075]],
		},
		[1076]=
		{
			id = 1076,
			cn = "老玩家不能绑定",
			bn = [[1076]],
		},
		[1077]=
		{
			id = 1077,
			cn = "请使用手机号登录",
			bn = [[1077]],
		},
		[2000]=
		{
			id = 2000,
			cn = "当前不是报名状态",
			bn = [[2000]],
		},
		[2001]=
		{
			id = 2001,
			cn = "游戏过于火爆， 请稍后再试",
			bn = [[2001]],
		},
		[2002]=
		{
			id = 2002,
			cn = "配置的进入条件 id 不存在",
			bn = [[2002]],
		},
		[2003]=
		{
			id = 2003,
			cn = "不在游戏中",
			bn = [[2003]],
		},
		[2004]=
		{
			id = 2004,
			cn = "状态不正确",
			bn = [[2004]],
		},
		[2005]=
		{
			id = 2005,
			cn = "重复创建比赛 id",
			bn = [[2005]],
		},
		[2006]=
		{
			id = 2006,
			cn = "比赛 id 不存在",
			bn = [[2006]],
		},
		[2007]=
		{
			id = 2007,
			cn = "比赛状态不正确， 不能开新场次",
			bn = [[2007]],
		},
		[2008]=
		{
			id = 2008,
			cn = "比赛实例 id 重复",
			bn = [[2008]],
		},
		[2009]=
		{
			id = 2009,
			cn = "比赛实例 id 不存在",
			bn = [[2009]],
		},
		[2010]=
		{
			id = 2010,
			cn = "您已经参加比赛了",
			bn = [[2010]],
		},
		[2011]=
		{
			id = 2011,
			cn = "您还未参加比赛",
			bn = [[2011]],
		},
		[2012]=
		{
			id = 2012,
			cn = "您还在比赛中， 不能退出比赛",
			bn = [[2012]],
		},
		[2013]=
		{
			id = 2013,
			cn = "比赛已经开始， 不能取消报名",
			bn = [[2013]],
		},
		[2014]=
		{
			id = 2014,
			cn = "比赛还没开始报名",
			bn = [[2014]],
		},
		[2015]=
		{
			id = 2015,
			cn = "比赛报名时间已过",
			bn = [[2015]],
		},
		[2016]=
		{
			id = 2016,
			cn = "您的复活次数已经用完了",
			bn = [[2016]],
		},
		[2017]=
		{
			id = 2017,
			cn = "您今天没有分享百万大奖赛",
			bn = [[2017]],
		},
		[2018]=
		{
			id = 2018,
			cn = "比赛即将关闭， 请稍后再试",
			bn = [[2018]],
		},
		[2019]=
		{
			id = 2019,
			cn = "房卡场选项重复",
			bn = [[2019]],
		},
		[2020]=
		{
			id = 2020,
			cn = "房卡场选项不存在",
			bn = [[2020]],
		},
		[2021]=
		{
			id = 2021,
			cn = "房卡场缺少选项",
			bn = [[2021]],
		},
		[2022]=
		{
			id = 2022,
			cn = "您已经准备了",
			bn = [[2022]],
		},
		[2023]=
		{
			id = 2023,
			cn = "您已经报过名了",
			bn = [[2023]],
		},
		[2024]=
		{
			id = 2024,
			cn = "当前报名人数已满， 请稍后再试",
			bn = [[2024]],
		},
		[2025]=
		{
			id = 2025,
			cn = "条件不满足",
			bn = [[2025]],
		},
		[2100]=
		{
			id = 2100,
			cn = "提交的lock_id不存在",
			bn = [[2100]],
		},
		[2101]=
		{
			id = 2101,
			cn = "解锁的lock_id不存在",
			bn = [[2101]],
		},
		[2150]=
		{
			id = 2150,
			cn = "用户登录ID不存在",
			bn = [[2150]],
		},
		[2151]=
		{
			id = 2151,
			cn = "登录渠道不存在",
			bn = [[2151]],
		},
		[2152]=
		{
			id = 2152,
			cn = "当前网络不稳定，如多次无法登录请联系客服。",
			bn = [[Jaringan saat ini tidak stabil, jika Anda tidak dapat login berkali-kali, silakan hubungi CS.]],
		},
		[2153]=
		{
			id = 2153,
			cn = "微信登录凭据不存在， 请重新授权微信登录",
			bn = [[2153]],
		},
		[2154]=
		{
			id = 2154,
			cn = "访问微信平台失败",
			bn = [[2154]],
		},
		[2155]=
		{
			id = 2155,
			cn = "微信验证凭据失效， 请重新授权微信登录",
			bn = [[2155]],
		},
		[2156]=
		{
			id = 2156,
			cn = "微信验证失败， 请重试",
			bn = [[2156]],
		},
		[2157]=
		{
			id = 2157,
			cn = "登录渠道未取得玩家",
			bn = [[2157]],
		},
		[2158]=
		{
			id = 2158,
			cn = "用户被禁止登陆",
			bn = [[2158]],
		},
		[2159]=
		{
			id = 2159,
			cn = "用户id不存在",
			bn = [[2159]],
		},
		[2201]=
		{
			id = 2201,
			cn = "已经进行过实名认证了",
			bn = [[2201]],
		},
		[2202]=
		{
			id = 2202,
			cn = "身份证号码错误",
			bn = [[2202]],
		},
		[2203]=
		{
			id = 2203,
			cn = "非老玩家用户",
			bn = [[2203]],
		},
		[2204]=
		{
			id = 2204,
			cn = "非新玩家用户",
			bn = [[2204]],
		},
		[2205]=
		{
			id = 2205,
			cn = "一个身份证号最多绑定5个同平台账号",
			bn = [[2205]],
		},
		[2206]=
		{
			id = 2206,
			cn = "未满18岁",
			bn = [[2206]],
		},
		[2231]=
		{
			id = 2231,
			cn = "订单不存在",
			bn = [[Pesanan tidak ada]],
		},
		[2232]=
		{
			id = 2232,
			cn = "不能修改已完成订单",
			bn = [[Tidak dapat mengubah pesanan yang telah selesai]],
		},
		[2233]=
		{
			id = 2233,
			cn = "单据不能修改为给定的状态",
			bn = [[Resi tidak dapat dimodifikasi ke status tertentu]],
		},
		[2234]=
		{
			id = 2234,
			cn = "需要提供渠道方的订单号",
			bn = [[Perlu memberikan nomor pesanan pihak saluran]],
		},
		[2235]=
		{
			id = 2235,
			cn = "购买金额不正确",
			bn = [[Jumlah pembelian salah]],
		},
		[2236]=
		{
			id = 2236,
			cn = "未知的购买渠道",
			bn = [[Saluran pembelian tidak diketahui]],
		},
		[2237]=
		{
			id = 2237,
			cn = "未知的购买币种",
			bn = [[Mata uang pembelian tidak diketahui]],
		},
		[2238]=
		{
			id = 2238,
			cn = "商品ID不存在",
			bn = [[ID Produk tidak ada]],
		},
		[2239]=
		{
			id = 2239,
			cn = "商品数量不正确",
			bn = [[Jumlah item salah]],
		},
		[2240]=
		{
			id = 2240,
			cn = "无法完成购买， 订单详情数据丢失",
			bn = [[Tidak dapat menyelesaikan pembelian,  data detail pesanan hilang]],
		},
		[2241]=
		{
			id = 2241,
			cn = "支付渠道返回",
			bn = [[Pengembalian saluran pembayaran]],
		},
		[2242]=
		{
			id = 2242,
			cn = "支付渠道返回",
			bn = [[Pengembalian saluran pembayaran]],
		},
		[2243]=
		{
			id = 2243,
			cn = "支付渠道已经关闭",
			bn = [[Saluran pembayaran telah ditutup]],
		},
		[2244]=
		{
			id = 2244,
			cn = "订单已经失败并关闭",
			bn = [[Pesanan telah gagal dan ditutup]],
		},
		[2245]=
		{
			id = 2245,
			cn = "支付异常",
			bn = [[Pembayaran tidak normal]],
		},
		[2246]=
		{
			id = 2246,
			cn = "登录过期， 请重新登录",
			bn = [[Login kedaluwarsa,  silakan login lagi]],
		},
		[2247]=
		{
			id = 2247,
			cn = "支付参数错误",
			bn = [[Kesalahan parameter pembayaran]],
		},
		[2248]=
		{
			id = 2248,
			cn = "用户取消支付",
			bn = [[User membatalkan pembayaran]],
		},
		[2251]=
		{
			id = 2251,
			cn = "玩家",
			bn = [[Pemain]],
		},
		[2252]=
		{
			id = 2252,
			cn = "提供的",
			bn = [[Penyedia]],
		},
		[2253]=
		{
			id = 2253,
			cn = "玩家余额不足",
			bn = [[2253]],
		},
		[2254]=
		{
			id = 2254,
			cn = "订单号重复",
			bn = [[2254]],
		},
		[2255]=
		{
			id = 2255,
			cn = "订单状态不正确",
			bn = [[2255]],
		},
		[2261]=
		{
			id = 2261,
			cn = "玩家提取数量超过账户金额",
			bn = [[2261]],
		},
		[2262]=
		{
			id = 2262,
			cn = "提现单号不存在",
			bn = [[2262]],
		},
		[2263]=
		{
			id = 2263,
			cn = "不能修改已完成的单据",
			bn = [[2263]],
		},
		[2264]=
		{
			id = 2264,
			cn = "提取金额低于最低提现额度",
			bn = [[2264]],
		},
		[2265]=
		{
			id = 2265,
			cn = "只有微信用户才能提取",
			bn = [[2265]],
		},
		[2266]=
		{
			id = 2266,
			cn = "今日提现次数已使用完",
			bn = [[2266]],
		},
		[2267]=
		{
			id = 2267,
			cn = "系统正在补货中",
			bn = [[2267]],
		},
		[2268]=
		{
			id = 2268,
			cn = "您今日的提现额度已达上限",
			bn = [[2268]],
		},
		[2269]=
		{
			id = 2269,
			cn = "本次提现额度将超过今日额度上限， 请明日再来！",
			bn = [[2269]],
		},
		[2270]=
		{
			id = 2270,
			cn = "不能修改已作废的单据",
			bn = [[2270]],
		},
		[2271]=
		{
			id = 2271,
			cn = "支付宝账号不存在",
			bn = [[2271]],
		},
		[2272]=
		{
			id = 2272,
			cn = "功能维护中， 暂未开放",
			bn = [[2272]],
		},
		[2273]=
		{
			id = 2273,
			cn = "提现失败",
			bn = [[2273]],
		},
		[2274]=
		{
			id = 2274,
			cn = "系统处理中， 请稍后查看",
			bn = [[2274]],
		},
		[2275]=
		{
			id = 2275,
			cn = "不支持的提现渠道",
			bn = [[2275]],
		},
		[2276]=
		{
			id = 2276,
			cn = "提现失败",
			bn = [[2276]],
		},
		[2277]=
		{
			id = 2277,
			cn = "支付宝绑定的游戏账号数量过多",
			bn = [[2277]],
		},
		[2301]=
		{
			id = 2301,
			cn = "邮件不存在",
			bn = [[Mail tidak ada]],
		},
		[2302]=
		{
			id = 2302,
			cn = "邮件已过期",
			bn = [[Mail telah kedaluwarsa]],
		},
		[2303]=
		{
			id = 2303,
			cn = "邮件已失效或过期",
			bn = [[Mail tidak valid atau telah kedaluwarsa]],
		},
		[2304]=
		{
			id = 2304,
			cn = "邮件没有可以领取的附件",
			bn = [[Mail tidak memiliki lampiran yang dapat diambil]],
		},
		[2305]=
		{
			id = 2305,
			cn = "邮件的附件已经被领取",
			bn = [[Lampiran mail telah diambil]],
		},
		[2306]=
		{
			id = 2306,
			cn = "未读邮件不能删除",
			bn = [[Mail yang belum dibaca tidak dapat dihapus]],
		},
		[2307]=
		{
			id = 2307,
			cn = "邮件已经被阅读",
			bn = [[Mail telah dibaca]],
		},
		[2308]=
		{
			id = 2308,
			cn = "邮件有附件不能被直接阅读",
			bn = [[Mail memiliki lampiran yang tidak dapat dibaca secara langsung]],
		},
		[2401]=
		{
			id = 2401,
			cn = "配置文件不正确",
			bn = [[File konfigurasi salah]],
		},
		[2402]=
		{
			id = 2402,
			cn = "服务器内部错误",
			bn = [[Kesalahan internal server]],
		},
		[2403]=
		{
			id = 2403,
			cn = "该功能被管理员关闭",
			bn = [[Fitur ini di non-aktifkan oleh admin]],
		},
		[2404]=
		{
			id = 2404,
			cn = "服务器启动还未完成， 请稍后再试",
			bn = [[Belum selesai memulai server,  silakan coba lagi nanti]],
		},
		[2405]=
		{
			id = 2405,
			cn = "服务器配置不正确",
			bn = [[Konfigurasi server salah]],
		},
		[2406]=
		{
			id = 2406,
			cn = "调用第三方服务失败",
			bn = [[Gagal memanggil layanan pihak ketiga]],
		},
		[2407]=
		{
			id = 2407,
			cn = "第三方服务参数错误",
			bn = [[Kesalahan parameter layanan pihak ketiga]],
		},
		[2408]=
		{
			id = 2408,
			cn = "第三方服务异常",
			bn = [[Layanan pihak ketiga tidak normal]],
		},
		[2409]=
		{
			id = 2409,
			cn = "投票操作太频繁",
			bn = [[2409]],
		},
		[2410]=
		{
			id = 2410,
			cn = "正在投票中， 不可再投票",
			bn = [[2410]],
		},
		[2411]=
		{
			id = 2411,
			cn = "房间号不存在， 或已解散",
			bn = [[2411]],
		},
		[2412]=
		{
			id = 2412,
			cn = "请求的资源不存在",
			bn = [[2412]],
		},
		[2413]=
		{
			id = 2413,
			cn = "此操作无需执行， 执行了也无所谓",
			bn = [[2413]],
		},
		[2414]=
		{
			id = 2414,
			cn = "增加的数据已经存在",
			bn = [[2414]],
		},
		[2415]=
		{
			id = 2415,
			cn = "要处理的数据条目不存在",
			bn = [[2415]],
		},
		[2501]=
		{
			id = 2501,
			cn = "appstore",
			bn = [[2501]],
		},
		[2502]=
		{
			id = 2502,
			cn = "appstore",
			bn = [[2502]],
		},
		[2503]=
		{
			id = 2503,
			cn = "appstore",
			bn = [[2503]],
		},
		[2504]=
		{
			id = 2504,
			cn = "交易已经完成了",
			bn = [[2504]],
		},
		[2601]=
		{
			id = 2601,
			cn = "验证码错误",
			bn = [[2601]],
		},
		[2602]=
		{
			id = 2602,
			cn = "验证码超时",
			bn = [[2602]],
		},
		[2603]=
		{
			id = 2603,
			cn = "输入的手机号已经被绑定过了",
			bn = [[2603]],
		},
		[2604]=
		{
			id = 2604,
			cn = "您还没有绑定手机号",
			bn = [[2604]],
		},
		[2605]=
		{
			id = 2605,
			cn = "更新的手机号和以前的手机号一致",
			bn = [[2605]],
		},
		[2606]=
		{
			id = 2606,
			cn = "请先获取验证码",
			bn = [[2606]],
		},
		[2701]=
		{
			id = 2701,
			cn = "该用户已经被锁定了",
			bn = [[2701]],
		},
		[2702]=
		{
			id = 2702,
			cn = "该用户没有被锁定",
			bn = [[2702]],
		},
		[2801]=
		{
			id = 2801,
			cn = "您还没有完成新手引导",
			bn = [[2801]],
		},
		[2802]=
		{
			id = 2802,
			cn = "您的新手引导话费奖励已经领取了",
			bn = [[2802]],
		},
		[3001]=
		{
			id = 3001,
			cn = "网络无法连接， 不能完成下载",
			bn = [[Jaringan tidak dapat terhubung dan unduhan tidak dapat diselesaikan]],
		},
		[3031]=
		{
			id = 3031,
			cn = "检测到未安装微信",
			bn = [[3031]],
		},
		[3032]=
		{
			id = 3032,
			cn = "您取消了微信登录",
			bn = [[3032]],
		},
		[3033]=
		{
			id = 3033,
			cn = "网络异常， 无法发送请求",
			bn = [[Jaringan tidak normal dan permintaan tidak dapat dikirim]],
		},
		[3034]=
		{
			id = 3034,
			cn = "QQ登录失败",
			bn = [[3034]],
		},
		[3035]=
		{
			id = 3035,
			cn = "QQ登录异常",
			bn = [[3035]],
		},
		[3036]=
		{
			id = 3036,
			cn = "手机未安装手Q",
			bn = [[3036]],
		},
		[3037]=
		{
			id = 3037,
			cn = "手机手Q版本太低",
			bn = [[3037]],
		},
		[3038]=
		{
			id = 3038,
			cn = "微信登录失败",
			bn = [[3038]],
		},
		[3039]=
		{
			id = 3039,
			cn = "手机未安装微信",
			bn = [[3039]],
		},
		[3040]=
		{
			id = 3040,
			cn = "手机微信版本太低",
			bn = [[3040]],
		},
		[3041]=
		{
			id = 3041,
			cn = "用户取消授权",
			bn = [[3041]],
		},
		[3042]=
		{
			id = 3042,
			cn = "用户拒绝授权",
			bn = [[3042]],
		},
		[3043]=
		{
			id = 3043,
			cn = "您尚未登录或者之前的登录已过期",
			bn = [[3043]],
		},
		[3044]=
		{
			id = 3044,
			cn = "您的账号没有进行实名认证， 请实名认证后重试",
			bn = [[3044]],
		},
		[3045]=
		{
			id = 3045,
			cn = "票据失效， 请退出游戏重新登录",
			bn = [[3045]],
		},
		[3046]=
		{
			id = 3046,
			cn = "取消分享",
			bn = [[3046]],
		},
		[3101]=
		{
			id = 3101,
			cn = "折扣券的类型不存在",
			bn = [[3101]],
		},
		[3102]=
		{
			id = 3102,
			cn = "折扣券的余量不足",
			bn = [[3102]],
		},
		[3103]=
		{
			id = 3103,
			cn = "折扣券的已过期",
			bn = [[3103]],
		},
		[3104]=
		{
			id = 3104,
			cn = "折扣券不存在",
			bn = [[3104]],
		},
		[3201]=
		{
			id = 3201,
			cn = "房间不存在",
			bn = [[3201]],
		},
		[3202]=
		{
			id = 3202,
			cn = "房间人数已满",
			bn = [[3202]],
		},
		[3203]=
		{
			id = 3203,
			cn = "操作过于频繁， 请等待几秒后尝试",
			bn = [[3203]],
		},
		[3204]=
		{
			id = 3204,
			cn = "房间人数已满",
			bn = [[3204]],
		},
		[3205]=
		{
			id = 3205,
			cn = "正在投票中",
			bn = [[3205]],
		},
		[3301]=
		{
			id = 3301,
			cn = "您已经获得了复赛资格， 不能再参加海选赛",
			bn = [[3301]],
		},
		[3302]=
		{
			id = 3302,
			cn = "比赛活动还未开放",
			bn = [[3302]],
		},
		[3401]=
		{
			id = 3401,
			cn = "您已经购买过此商品了， 不能重复购买",
			bn = [[Anda telah membeli produk ini,  tidak dapat membelinya lagi]],
		},
		[3402]=
		{
			id = 3402,
			cn = "为避免重复支付， 请于30秒之后重新购买",
			bn = [[Untuk menghindari dua kali pembayaran,  silakan beli kembali setelah 10 detik]],
		},
		[3403]=
		{
			id = 3403,
			cn = "抱歉， 此商品已经卖完",
			bn = [[Maaf,  produk ini telah habis terjual]],
		},
		[3404]=
		{
			id = 3404,
			cn = "抱歉， 此商品不在售卖时间内",
			bn = [[Maaf,  waktu penjualan produk ini telah habis]],
		},
		[3405]=
		{
			id = 3405,
			cn = "您今日已经购买， 请等待明日再进行购买",
			bn = [[Anda telah membeli hari ini,  harap tunggu besok untuk membeli lagi]],
		},
		[3406]=
		{
			id = 3406,
			cn = "您不满足购买条件",
			bn = [[Anda tidak memenuhi syarat pembelian]],
		},
		[3501]=
		{
			id = 3501,
			cn = "您没有可领取的福利券奖励",
			bn = [[3501]],
		},
		[3502]=
		{
			id = 3502,
			cn = "您没有可领取的现金奖励",
			bn = [[3502]],
		},
		[3601]=
		{
			id = 3601,
			cn = "您已经参加过比赛了",
			bn = [[3601]],
		},
		[3602]=
		{
			id = 3602,
			cn = "您的参赛码无效",
			bn = [[3602]],
		},
		[3801]=
		{
			id = 3801,
			cn = "任务奖励领取失败",
			bn = [[Gagal mengklaim hadiah tugas]],
		},
		[3802]=
		{
			id = 3802,
			cn = "任务奖励领取达到上限",
			bn = [[Klaim hadiah tugas mencapai batas]],
		},
		[3803]=
		{
			id = 3803,
			cn = "没有找回奖励可领取",
			bn = [[Tidak ada hadiah yang dapat diambil]],
		},
		[3804]=
		{
			id = 3804,
			cn = "vip返奖任务每日完成记录获取失败",
			bn = [[3804]],
		},
		[3805]=
		{
			id = 3805,
			cn = "vip返奖任务找回奖励记录获取失败",
			bn = [[3805]],
		},
		[3806]=
		{
			id = 3806,
			cn = "vip推广奖励记录获取失败",
			bn = [[3806]],
		},
		[3807]=
		{
			id = 3807,
			cn = "vip推广奖励提取记录获取失败",
			bn = [[3807]],
		},
		[3808]=
		{
			id = 3808,
			cn = "任务有效期已过",
			bn = [[3808]],
		},
		[3809]=
		{
			id = 3809,
			cn = "只有在比赛当天并且20",
			bn = [[3809]],
		},
		[3810]=
		{
			id = 3810,
			cn = "Vip1才可领取， 你目前还不是Vip1",
			bn = [[3810]],
		},
		[3811]=
		{
			id = 3811,
			cn = "Vip2才可领取， 你目前还不是Vip2",
			bn = [[3811]],
		},
		[3812]=
		{
			id = 3812,
			cn = "Vip3才可领取， 你目前还不是Vip3",
			bn = [[3812]],
		},
		[3901]=
		{
			id = 3901,
			cn = "头像框不可用",
			bn = [[Bingkai avatar tidak tersedia]],
		},
		[3902]=
		{
			id = 3902,
			cn = "装扮不可用",
			bn = [[Emoji tidak tersedia]],
		},
		[3903]=
		{
			id = 3903,
			cn = "装扮数量不足",
			bn = [[Jumlah emoji tidak mencukupi]],
		},
		[3904]=
		{
			id = 3904,
			cn = "装扮已经过期",
			bn = [[Emoji telah kedaluwarsa]],
		},
		[3905]=
		{
			id = 3905,
			cn = "装扮数量超过持有上限",
			bn = [[Jumlah emoji telah melebihi batas]],
		},
		[3906]=
		{
			id = 3906,
			cn = "持有金币大于50万才可购买",
			bn = [[Anda dapat membeli jika memiliki Koin lebih dari 500.000]],
		},
		[4001]=
		{
			id = 4001,
			cn = "购买vip天数达到上限",
			bn = [[Jumlah hari untuk pembelian VIP telah mencapai batas]],
		},
		[4002]=
		{
			id = 4002,
			cn = "推广奖励不足",
			bn = [[4002]],
		},
		[4003]=
		{
			id = 4003,
			cn = "今日推广奖励领取已达上限",
			bn = [[4003]],
		},
		[4004]=
		{
			id = 4004,
			cn = "获取推广统计记录失败",
			bn = [[4004]],
		},
		[4005]=
		{
			id = 4005,
			cn = "Vip才可领取奖金",
			bn = [[4005]],
		},
		[4101]=
		{
			id = 4101,
			cn = "兑换码已经被使用过了",
			bn = [[Kode penukaran telah digunakan]],
		},
		[4102]=
		{
			id = 4102,
			cn = "兑换码无效",
			bn = [[Kode penukaran tidak valid]],
		},
		[4103]=
		{
			id = 4103,
			cn = "您操作错误过多， 稍后再试",
			bn = [[Anda operasi terlalu banyak kesalahan, coba lagi nanti]],
		},
		[4104]=
		{
			id = 4104,
			cn = "您的此类型的兑换码的使用次数已经用完",
			bn = [[Anda telah habiskan jumlah kode penukaran jenis ini]],
		},
		[4105]=
		{
			id = 4105,
			cn = "兑换码当前不可用",
			bn = [[Kode penukaran saat ini tidak tersedia]],
		},
		[4106]=
		{
			id = 4106,
			cn = "您的注册时间不满足使用此兑换码的要求",
			bn = [[Waktu pendaftaran Anda tidak memenuhi persyaratan kode penukaran ini]],
		},
		[4107]=
		{
			id = 4107,
			cn = "此兑换码已兑换完",
			bn = [[Kode penukaran ini telah habis]],
		},
		[4108]=
		{
			id = 4108,
			cn = "您当前不能使用此类型的兑换码",
			bn = [[Saat ini Anda tidak dapat menggunakan jenis kode penukaran ini]],
		},
		[4109]=
		{
			id = 4109,
			cn = "您的账号渠道和兑换码不符",
			bn = [[Saluran akun dan kode penukaran Anda tidak cocok]],
		},
		[4201]=
		{
			id = 4201,
			cn = "今日领取破产补助次数已使用完",
			bn = [[4201]],
		},
		[4202]=
		{
			id = 4202,
			cn = "未达成领取破产补助条件",
			bn = [[4202]],
		},
		[4203]=
		{
			id = 4203,
			cn = "疯狂捕鱼游戏中， 无法领取",
			bn = [[4203]],
		},
		[4204]=
		{
			id = 4204,
			cn = "正在游戏中无法领取",
			bn = [[4204]],
		},
		[4301]=
		{
			id = 4301,
			cn = "上下级关系不合法",
			bn = [[4301]],
		},
		[4403]=
		{
			id = 4403,
			cn = "高级合伙人状态数据不合法",
			bn = [[4403]],
		},
		[4404]=
		{
			id = 4404,
			cn = "高级合伙人开关数据不合法",
			bn = [[4404]],
		},
		[4405]=
		{
			id = 4405,
			cn = "高级合伙人不存在",
			bn = [[4405]],
		},
		[4406]=
		{
			id = 4406,
			cn = "高级合伙人已存在",
			bn = [[4406]],
		},
		[4407]=
		{
			id = 4407,
			cn = "高级合伙人部分操作失败",
			bn = [[4407]],
		},
		[4408]=
		{
			id = 4408,
			cn = "账目核算中",
			bn = [[4408]],
		},
		[4409]=
		{
			id = 4409,
			cn = "您已被冻结推广员资格， 请联系商务微信：JY400888。",
			bn = [[4409]],
		},
		[4410]=
		{
			id = 4410,
			cn = "该邀请码错误！",
			bn = [[4410]],
		},
		[4411]=
		{
			id = 4411,
			cn = "不可添加自己的邀请码！",
			bn = [[4411]],
		},
		[4501]=
		{
			id = 4501,
			cn = "领取条件不满足",
			bn = [[4501]],
		},
		[4502]=
		{
			id = 4502,
			cn = "领取的活动不存在或已结束",
			bn = [[4502]],
		},
		[4503]=
		{
			id = 4503,
			cn = "领取失败",
			bn = [[4503]],
		},
		[4600]=
		{
			id = 4600,
			cn = "限时礼包开启",
			bn = [[4600]],
		},
		[4601]=
		{
			id = 4601,
			cn = "金币不足， 限时礼包开启",
			bn = [[4601]],
		},
		[4602]=
		{
			id = 4602,
			cn = "活动不存在或者已经结束",
			bn = [[4602]],
		},
		[4603]=
		{
			id = 4603,
			cn = "福气值不足， 普通模式中砸蛋可增加福气值",
			bn = [[4603]],
		},
		[4700]=
		{
			id = 4700,
			cn = "兑换的活动类型不存在",
			bn = [[4700]],
		},
		[4701]=
		{
			id = 4701,
			cn = "兑换活动不在时间范围内",
			bn = [[4701]],
		},
		[4702]=
		{
			id = 4702,
			cn = "兑换内容不存在",
			bn = [[4702]],
		},
		[4703]=
		{
			id = 4703,
			cn = "兑换内容不满足兑换条件",
			bn = [[4703]],
		},
		[4704]=
		{
			id = 4704,
			cn = "您不能再兑换此物品了",
			bn = [[4704]],
		},
		[4705]=
		{
			id = 4705,
			cn = "兑奖券数量不足",
			bn = [[4705]],
		},
		[4800]=
		{
			id = 4800,
			cn = "今天的抽奖次数已经用完了",
			bn = [[4800]],
		},
		[4801]=
		{
			id = 4801,
			cn = "您必须使用完抽奖次数才能开启",
			bn = [[4801]],
		},
		[4802]=
		{
			id = 4802,
			cn = "您已经开过宝箱了",
			bn = [[4802]],
		},
		[4803]=
		{
			id = 4803,
			cn = "您必须先开宝箱才能继续抽奖",
			bn = [[4803]],
		},
		[4901]=
		{
			id = 4901,
			cn = "道具不存在",
			bn = [[4901]],
		},
		[4902]=
		{
			id = 4902,
			cn = "道具已过期",
			bn = [[4902]],
		},
		[4903]=
		{
			id = 4903,
			cn = "道具当前不可用",
			bn = [[4903]],
		},
		[5001]=
		{
			id = 5001,
			cn = "已在活动中， 请在活动结束后再试。",
			bn = [[5001]],
		},
		[5101]=
		{
			id = 5101,
			cn = "已经领取过奖励了。",
			bn = [[5101]],
		},
		[5102]=
		{
			id = 5102,
			cn = "抽奖条件未达成。",
			bn = [[5102]],
		},
		[5103]=
		{
			id = 5103,
			cn = "抽奖尚未开始。",
			bn = [[5103]],
		},
		[5104]=
		{
			id = 5104,
			cn = "抽奖已结束。",
			bn = [[5104]],
		},
		[5105]=
		{
			id = 5105,
			cn = "没有奖励数据。",
			bn = [[5105]],
		},
		[5201]=
		{
			id = 5201,
			cn = "活动已结束。",
			bn = [[5201]],
		},
		[5202]=
		{
			id = 5202,
			cn = "您已经许过愿了！",
			bn = [[5202]],
		},
		[5203]=
		{
			id = 5203,
			cn = "没有许愿， 不能领奖！",
			bn = [[5203]],
		},
		[5204]=
		{
			id = 5204,
			cn = "倒计时未到， 不能领奖！",
			bn = [[5204]],
		},
		[5205]=
		{
			id = 5205,
			cn = "没有许愿， 不能放弃领奖！",
			bn = [[5205]],
		},
		[5206]=
		{
			id = 5206,
			cn = "不在领奖时间段内",
			bn = [[5206]],
		},
		[5207]=
		{
			id = 5207,
			cn = "不在活动时间段内",
			bn = [[5207]],
		},
		[5208]=
		{
			id = 5208,
			cn = "积分不足！",
			bn = [[5208]],
		},
		[5209]=
		{
			id = 5209,
			cn = "抽奖失败！",
			bn = [[5209]],
		},
		[5210]=
		{
			id = 5210,
			cn = "今日次数已用尽， 请明日再来！",
			bn = [[5210]],
		},
		[5211]=
		{
			id = 5211,
			cn = "此商品已兑换完， 请明日再来！",
			bn = [[5211]],
		},
		[5212]=
		{
			id = 5212,
			cn = "不满足活动条件",
			bn = [[5212]],
		},
		[5301]=
		{
			id = 5301,
			cn = "游戏未开放。",
			bn = [[5301]],
		},
		[5302]=
		{
			id = 5302,
			cn = "已经不在购买时间",
			bn = [[5302]],
		},
		[5303]=
		{
			id = 5303,
			cn = "金币不足",
			bn = [[Koin tidak cukup]],
		},
		[5304]=
		{
			id = 5304,
			cn = "购买达上限",
			bn = [[5304]],
		},
		[5305]=
		{
			id = 5305,
			cn = "购买失败",
			bn = [[5305]],
		},
		[5306]=
		{
			id = 5306,
			cn = "没有购买记录",
			bn = [[5306]],
		},
		[5307]=
		{
			id = 5307,
			cn = "游戏已经到的最大人数",
			bn = [[5307]],
		},
		[5308]=
		{
			id = 5308,
			cn = "撤销失败",
			bn = [[5308]],
		},
		[5309]=
		{
			id = 5309,
			cn = "没有历史记录",
			bn = [[5309]],
		},
		[5310]=
		{
			id = 5310,
			cn = "自动购买次数超上限了",
			bn = [[5310]],
		},
		[5311]=
		{
			id = 5311,
			cn = "单条购买达上限！",
			bn = [[5311]],
		},
		[5312]=
		{
			id = 5312,
			cn = "游戏关闭",
			bn = [[5312]],
		},
		[5313]=
		{
			id = 5313,
			cn = "当前已经在自动购买了",
			bn = [[5313]],
		},
		[5314]=
		{
			id = 5314,
			cn = "当前没有自动购买状态了",
			bn = [[5314]],
		},
		[5315]=
		{
			id = 5315,
			cn = "没有奖励",
			bn = [[5315]],
		},
		[5316]=
		{
			id = 5316,
			cn = "当前不能领奖",
			bn = [[5316]],
		},
		[5317]=
		{
			id = 5317,
			cn = "已经停止自动购买",
			bn = [[5317]],
		},
		[5318]=
		{
			id = 5318,
			cn = "能量值耗尽",
			bn = [[5318]],
		},
		[5319]=
		{
			id = 5319,
			cn = "能量已注入",
			bn = [[5319]],
		},
		[5320]=
		{
			id = 5320,
			cn = "不能重复自动充能",
			bn = [[5320]],
		},
		[5321]=
		{
			id = 5321,
			cn = "已经充能， 不能自动充能",
			bn = [[5321]],
		},
		[5322]=
		{
			id = 5322,
			cn = "已经不是自动充能",
			bn = [[5322]],
		},
		[5344]=
		{
			id = 5344,
			cn = "不是自动充能状态， 不能自动充能",
			bn = [[5344]],
		},
		[5345]=
		{
			id = 5345,
			cn = "上轮未充能， 无法自动充能",
			bn = [[5345]],
		},
		[5346]=
		{
			id = 5346,
			cn = "已经充能， 不能连续充能",
			bn = [[5346]],
		},
		[5347]=
		{
			id = 5347,
			cn = "不在充能状态",
			bn = [[5347]],
		},
		[5348]=
		{
			id = 5348,
			cn = "自动充能中， 不能连续充能",
			bn = [[5348]],
		},
		[5349]=
		{
			id = 5349,
			cn = "上轮未充能， 无法连续充能",
			bn = [[5349]],
		},
		[5350]=
		{
			id = 5350,
			cn = "充能已达到上限， 不可继续充能。",
			bn = [[5350]],
		},
		[5351]=
		{
			id = 5351,
			cn = "龙王不能下注",
			bn = [[5351]],
		},
		[5352]=
		{
			id = 5352,
			cn = "充能中， 不能退出",
			bn = [[5352]],
		},
		[5353]=
		{
			id = 5353,
			cn = "您当前正在龙王争霸， 不能退出",
			bn = [[5353]],
		},
		[5401]=
		{
			id = 5401,
			cn = "已经预约过了",
			bn = [[5401]],
		},
		[5501]=
		{
			id = 5501,
			cn = "您的师傅数量已达上限",
			bn = [[5501]],
		},
		[5502]=
		{
			id = 5502,
			cn = "此人徒弟数量已达上限",
			bn = [[5502]],
		},
		[5503]=
		{
			id = 5503,
			cn = "已存在师徒关系， 无法拜师",
			bn = [[5503]],
		},
		[5504]=
		{
			id = 5504,
			cn = "已存在师徒关系， 请前往我的师父列表恢复关系",
			bn = [[5504]],
		},
		[5505]=
		{
			id = 5505,
			cn = "师徒关系解除冷却期中",
			bn = [[5505]],
		},
		[5506]=
		{
			id = 5506,
			cn = "师徒关系形成回路",
			bn = [[5506]],
		},
		[5507]=
		{
			id = 5507,
			cn = "信息已过期",
			bn = [[5507]],
		},
		[5508]=
		{
			id = 5508,
			cn = "师徒关系不正确",
			bn = [[5508]],
		},
		[5509]=
		{
			id = 5509,
			cn = "消息不存在",
			bn = [[5509]],
		},
		[5510]=
		{
			id = 5510,
			cn = "自己不能拜自己为师",
			bn = [[5510]],
		},
		[5511]=
		{
			id = 5511,
			cn = "信息已处理",
			bn = [[5511]],
		},
		[5512]=
		{
			id = 5512,
			cn = "当天已点过赞",
			bn = [[5512]],
		},
		[5513]=
		{
			id = 5513,
			cn = "今日任务已达上限",
			bn = [[5513]],
		},
		[5514]=
		{
			id = 5514,
			cn = "任务状态不对",
			bn = [[5514]],
		},
		[5515]=
		{
			id = 5515,
			cn = "任务不存在",
			bn = [[5515]],
		},
		[5516]=
		{
			id = 5516,
			cn = "今日激励箱子个数已上限",
			bn = [[5516]],
		},
		[5517]=
		{
			id = 5517,
			cn = "该激励道具不存在",
			bn = [[5517]],
		},
		[5518]=
		{
			id = 5518,
			cn = "单次赠送超过上限",
			bn = [[5518]],
		},
		[5519]=
		{
			id = 5519,
			cn = "今日免费宝箱赠送已达上限",
			bn = [[5519]],
		},
		[5520]=
		{
			id = 5520,
			cn = "信息已发送， 请勿反复发送",
			bn = [[5520]],
		},
		[5521]=
		{
			id = 5521,
			cn = "您已经发布过了收徒信息",
			bn = [[5521]],
		},
		[5522]=
		{
			id = 5522,
			cn = "删除失败",
			bn = [[5522]],
		},
		[5523]=
		{
			id = 5523,
			cn = "不可拜师， 该玩家已拒绝过你的请求或者最近撤回过对该玩家的请求",
			bn = [[5523]],
		},
		[5524]=
		{
			id = 5524,
			cn = "今天拜师次数已达上限",
			bn = [[5524]],
		},
		[5525]=
		{
			id = 5525,
			cn = "该徒弟今天已经领过免费宝箱了",
			bn = [[5525]],
		},
		[5526]=
		{
			id = 5526,
			cn = "今日点赞次数已达上限",
			bn = [[5526]],
		},
		[5527]=
		{
			id = 5527,
			cn = "上次解除的师父不是当前师父",
			bn = [[5527]],
		},
		[5528]=
		{
			id = 5528,
			cn = "当日取消拜师次数已达上限",
			bn = [[5528]],
		},
		[5529]=
		{
			id = 5529,
			cn = "当日收徒数量已达上限",
			bn = [[5529]],
		},
		[5530]=
		{
			id = 5530,
			cn = "广场信息过于火爆， 请稍后再试",
			bn = [[5530]],
		},
		[5531]=
		{
			id = 5531,
			cn = "您拥有的道具数量不足",
			bn = [[5531]],
		},
		[5601]=
		{
			id = 5601,
			cn = "宝箱已经领过了",
			bn = [[5601]],
		},
		[5602]=
		{
			id = 5602,
			cn = "宝箱已经领过了， 不可参与点赞",
			bn = [[5602]],
		},
		[5603]=
		{
			id = 5603,
			cn = "取消点赞错误",
			bn = [[5603]],
		},
		[5604]=
		{
			id = 5604,
			cn = "点赞数已达上限",
			bn = [[5604]],
		},
		[5605]=
		{
			id = 5605,
			cn = "内容过长",
			bn = [[5605]],
		},
		[5606]=
		{
			id = 5606,
			cn = "还未点过赞， 不能领取宝箱",
			bn = [[5606]],
		},
		[5607]=
		{
			id = 5607,
			cn = "建议提交过于频繁",
			bn = [[5607]],
		},
		[5701]=
		{
			id = 5701,
			cn = "兑换失败， 没有兑换规则",
			bn = [[5701]],
		},
		[5702]=
		{
			id = 5702,
			cn = "兑换失败， 条件不满足",
			bn = [[5702]],
		},
		[5801]=
		{
			id = 5801,
			cn = "参与条件不满足",
			bn = [[5801]],
		},
		[5802]=
		{
			id = 5802,
			cn = "红包已过期",
			bn = [[5802]],
		},
		[5803]=
		{
			id = 5803,
			cn = "红包已领完",
			bn = [[5803]],
		},
		[5804]=
		{
			id = 5804,
			cn = "领红包次数不足",
			bn = [[5804]],
		},
		[5805]=
		{
			id = 5805,
			cn = "当前红包已领取",
			bn = [[5805]],
		},
		[5806]=
		{
			id = 5806,
			cn = "发红包金额不满足条件",
			bn = [[5806]],
		},
		[5807]=
		{
			id = 5807,
			cn = "携带金额不满足领此红包条件",
			bn = [[5807]],
		},
		[5808]=
		{
			id = 5808,
			cn = "资产不足",
			bn = [[5808]],
		},
		[5809]=
		{
			id = 5809,
			cn = "不在游戏时间段内",
			bn = [[5809]],
		},
		[5810]=
		{
			id = 5810,
			cn = "游戏参与人数过多， 稍后再试",
			bn = [[5810]],
		},
		[5811]=
		{
			id = 5811,
			cn = "场中存在您已发出但未抢完的红包， 请抢完或者过期后再发",
			bn = [[5811]],
		},
		[5812]=
		{
			id = 5812,
			cn = "当前发红包人数过多， 请稍后再试",
			bn = [[5812]],
		},
		[5813]=
		{
			id = 5813,
			cn = "红包数量不对",
			bn = [[5813]],
		},
		[5814]=
		{
			id = 5814,
			cn = "红包不存在",
			bn = [[5814]],
		},
		[5815]=
		{
			id = 5815,
			cn = "当前抢红包人数过多， 请稍后再试",
			bn = [[5815]],
		},
		[5901]=
		{
			id = 5901,
			cn = "权限错误",
			bn = [[5901]],
		},
		[5911]=
		{
			id = 5911,
			cn = "您正在活动中",
			bn = [[5911]],
		},
		[5912]=
		{
			id = 5912,
			cn = "您使用的道具无效",
			bn = [[5912]],
		},
		[5913]=
		{
			id = 5913,
			cn = "您使用的道具不能在当前场景使用",
			bn = [[5913]],
		},
		[5914]=
		{
			id = 5914,
			cn = "即将切换渔场不能使用冰冻",
			bn = [[5914]],
		},
		[5991]=
		{
			id = 5991,
			cn = "季卡到期或未购买， 抽奖次数不足",
			bn = [[5991]],
		},
		[5992]=
		{
			id = 5992,
			cn = "游戏已选择， 请选其他游戏",
			bn = [[5992]],
		},
		[5993]=
		{
			id = 5993,
			cn = "次数不足",
			bn = [[5993]],
		},
		[6001]=
		{
			id = 6001,
			cn = "彩贝位置错误",
			bn = [[6001]],
		},
		[6002]=
		{
			id = 6002,
			cn = "彩贝状态错误",
			bn = [[6002]],
		},
		[6003]=
		{
			id = 6003,
			cn = "彩贝同时开启数量错误",
			bn = [[6003]],
		},
		[6004]=
		{
			id = 6004,
			cn = "彩贝类型错误",
			bn = [[6004]],
		},
		[6005]=
		{
			id = 6005,
			cn = "彩贝还未到时",
			bn = [[6005]],
		},
		[6006]=
		{
			id = 6006,
			cn = "彩贝已经可以领取",
			bn = [[6006]],
		},
		[6007]=
		{
			id = 6007,
			cn = "今天已免费领取最大次数",
			bn = [[6007]],
		},
		[6008]=
		{
			id = 6008,
			cn = "免费领取还在CD",
			bn = [[6008]],
		},
		[6009]=
		{
			id = 6009,
			cn = "格子已满， 无法领取",
			bn = [[6009]],
		},
		[6010]=
		{
			id = 6010,
			cn = "快速领取， 金币不够",
			bn = [[6010]],
		},
		[6101]=
		{
			id = 6101,
			cn = "今天已到最大开奖次数",
			bn = [[6101]],
		},
		[6102]=
		{
			id = 6102,
			cn = "击杀彩金鱼数量不够",
			bn = [[6102]],
		},
		[6103]=
		{
			id = 6103,
			cn = "分数不满足",
			bn = [[6103]],
		},
		[6104]=
		{
			id = 6104,
			cn = "彩贝类型错误",
			bn = [[6104]],
		},
		[6105]=
		{
			id = 6105,
			cn = "彩贝还未到时",
			bn = [[6105]],
		},
		[6106]=
		{
			id = 6106,
			cn = "彩贝已经可以领取",
			bn = [[6106]],
		},
		[6107]=
		{
			id = 6107,
			cn = "今天已免费领取最大次数",
			bn = [[6107]],
		},
		[6108]=
		{
			id = 6108,
			cn = "免费领取还在CD",
			bn = [[6108]],
		},
		[6301]=
		{
			id = 6301,
			cn = "不满足六合一抽奖状态",
			bn = [[6301]],
		},
		[6201]=
		{
			id = 6201,
			cn = "底分条件设置有误， 请检查",
			bn = [[6201]],
		},
		[6202]=
		{
			id = 6202,
			cn = "入场条件设置有误， 请检查",
			bn = [[6202]],
		},
		[6203]=
		{
			id = 6203,
			cn = "房主不用点准备， 只能开始游戏",
			bn = [[6203]],
		},
		[6204]=
		{
			id = 6204,
			cn = "密码输入错误",
			bn = [[6204]],
		},
		[6205]=
		{
			id = 6205,
			cn = "规则没有变动",
			bn = [[6205]],
		},
		[6206]=
		{
			id = 6206,
			cn = "玩家准备人数不足",
			bn = [[6206]],
		},
		[6300]=
		{
			id = 6300,
			cn = "昵称不能为空， 请修改后重试",
			bn = [[Nama panggilan harus diisi,  harap diubah dan coba lagi]],
		},
		[6302]=
		{
			id = 6302,
			cn = "此昵称已被占用， 请修改后重试",
			bn = [[Nama panggilan telah digunakan,  harap diubah dan coba lagi]],
		},
		[6303]=
		{
			id = 6303,
			cn = "此昵称含有敏感词汇， 请修改后重试",
			bn = [[Nama panggilan berisi kata-kata yang sensitif,  harap diubah dan coba lagi]],
		},
		[6304]=
		{
			id = 6304,
			cn = "此昵称含有特殊字符， 请修改后重试",
			bn = [[Nama panggilan ini berisi karakter khusus,  harap diubah dan coba lagi]],
		},
		[6305]=
		{
			id = 6305,
			cn = "此昵称过长， 请修改后重试",
			bn = [[Nama panggilan ini terlalu panjang,  harap diubah dan coba lagi]],
		},
		[6306]=
		{
			id = 6306,
			cn = "您的VIP等级不足， 升级VIP即可体验尊贵权限",
			bn = [[Level VIP tidak mencukupi,  anda dapat menikmati hak istimewa dengan meningkatkan Level VIP anda]],
		},
		[6307]=
		{
			id = 6307,
			cn = "切换头像需间隔60秒， 请稍后再试",
			bn = [[Dibutuhkan 60 detik untuk mengganti avatar,  silakan coba lagi]],
		},
		[6308]=
		{
			id = 6308,
			cn = "修改昵称需间隔60秒， 请稍后再试",
			bn = [[Dibutuhkan 60 detik untuk mengubah nama panggilan,  silakan coba lagi]],
		},
		[6309]=
		{
			id = 6309,
			cn = "您的玩家等级不足， 升级玩家等级即可体验尊贵权限",
			bn = [[Level pemain anda tidak mencukupi,  tingkatkan level pemain untuk menikmati hak istimewa]],
		},
		[6310]=
		{
			id = 6310,
			cn = "抽奖条件不满足",
			bn = [[6310]],
		},
		[6311]=
		{
			id = 6311,
			cn = "抽奖次数不足",
			bn = [[6311]],
		},
		[6401]=
		{
			id = 6401,
			cn = "当前已在争夺龙王中， 不可再次争夺。",
			bn = [[6401]],
		},
		[6402]=
		{
			id = 6402,
			cn = "当前争夺龙王排队已满， 请稍后再争夺。",
			bn = [[6402]],
		},
		[6403]=
		{
			id = 6403,
			cn = "你当前不在争夺龙王队列中",
			bn = [[6403]],
		},
		[6404]=
		{
			id = 6404,
			cn = "当前不可争夺龙王",
			bn = [[6404]],
		},
		[10000]=
		{
			id = 10000,
			cn = "多米诺",
			bn = [[Domino]],
		},
		[10001]=
		{
			id = 10001,
			cn = "卢多棋\n(2人)",
			bn = [[Ludo\n（2P）]],
		},
		[10002]=
		{
			id = 10002,
			cn = "卢多棋\n（4人）",
			bn = [[Ludo\n（2P）]],
		},
		[10003]=
		{
			id = 10003,
			cn = "多米诺\n（加倍）",
			bn = [[Domino\n（BET）]],
		},
		[10004]=
		{
			id = 10004,
			cn = "QiuQiu",
			bn = [[QiuQiu]],
		},
		[10005]=
		{
			id = 10005,
			cn = "更新完毕， 请重启游戏",
			bn = [[Update selesai,  silakan restart game]],
		},
		[10006]=
		{
			id = 10006,
			cn = "您的账号已经在其他设备登陆",
			bn = [[Akun anda telah digunakan di perangkat lain]],
		},
		[10007]=
		{
			id = 10007,
			cn = "测试期间， 暂不开放",
			bn = [[Selama periode tes,  tidak terbuka]],
		},
		[10008]=
		{
			id = 10008,
			cn = "修复完毕， 请重新运行游戏",
			bn = [[Selesai diperbaiki,  silakan restart game!]],
		},
		[10009]=
		{
			id = 10009,
			cn = "账号不存在， 请重新尝试用其他账号",
			bn = [[Akun tidak ada,  silahkan coba akun lain]],
		},
		[10010]=
		{
			id = 10010,
			cn = "当前网络不稳定，请稍后重试登录。",
			bn = [[Jaringan saat ini tidak stabil, silakan coba masuk lagi nanti.]],
		},
		[10011]=
		{
			id = 10011,
			cn = "连接服务器失败， 请检查网络是否连接",
			bn = [[Gagal terhubung dengan server,  mohon periksa jaringan]],
		},
		[10012]=
		{
			id = 10012,
			cn = "今日领取次数已用完!",
			bn = [[Jumlah klaim hari ini telah habis!]],
		},
		[10013]=
		{
			id = 10013,
			cn = "数据不存在",
			bn = [[Data tidak ada]],
		},
		[10014]=
		{
			id = 10014,
			cn = "身上金币不小于",
			bn = [[Koin tidak kurang dari]],
		},
		[10015]=
		{
			id = 10015,
			cn = "客户端有更新!",
			bn = [[Terdapat update pada client!]],
		},
		[10016]=
		{
			id = 10016,
			cn = "发生崩溃， 点击确定自动通知开发人员",
			bn = [[terjadi crash,ketuk Tentukan untuk secara otomatis memberi tahu pengembang]],
		},
		[10017]=
		{
			id = 10017,
			cn = "当前无法进行此操作",
			bn = [[Saat ini tidak dapat melakukan tindakan ini]],
		},
		[10018]=
		{
			id = 10018,
			cn = "正在登录",
			bn = [[Sedang login…]],
		},
		[20000]=
		{
			id = 20000,
			cn = "没有邮件",
			bn = [[Maaf, Anda belum memiliki surat.]],
		},
		[20001]=
		{
			id = 20001,
			cn = "标题",
			bn = [[Topik:]],
		},
		[20002]=
		{
			id = 20002,
			cn = "发件人",
			bn = [[Pengirim:]],
		},
		[20003]=
		{
			id = 20003,
			cn = "奖  励",
			bn = [[Hadiah]],
		},
		[20004]=
		{
			id = 20004,
			cn = "领  取",
			bn = [[Ambil]],
		},
		[20005]=
		{
			id = 20005,
			cn = "一键领取",
			bn = [[Ambil Semua]],
		},
		[20006]=
		{
			id = 20006,
			cn = "删  除",
			bn = [[Hapus]],
		},
		[20007]=
		{
			id = 20007,
			cn = "系统通知",
			bn = [[Notifikasi sistem]],
		},
		[20008]=
		{
			id = 20008,
			cn = "金币",
			bn = [[Koin]],
		},
		[20009]=
		{
			id = 20009,
			cn = "因当前网络不稳定而断开连接，请重新登录。",
			bn = [[Terputus karena ketidakstabilan jaringan saat ini, harap masuk lagi.]],
		},
		[20010]=
		{
			id = 20010,
			cn = "附件",
			bn = [[Lampiran]],
		},
		[20011]=
		{
			id = 20011,
			cn = "FaceBook登陆错误",
			bn = [[Kesalahan login facebook]],
		},
		[20012]=
		{
			id = 20012,
			cn = "取消登陆",
			bn = [[Batalkan login]],
		},
		[20013]=
		{
			id = 20013,
			cn = "再消费%s元可提升至%s",
			bn = [[Top up <color=#EF5B00>%s</color> bisa mencapai <color=#EF5B00>%s</color>]],
		},
		[20014]=
		{
			id = 20014,
			cn = "前往充值",
			bn = [[Top up]],
		},
		[20015]=
		{
			id = 20015,
			cn = "特权礼包",
			bn = [[Paket]],
		},
		[20016]=
		{
			id = 20016,
			cn = "领取",
			bn = [[Ambil]],
		},
		[20017]=
		{
			id = 20017,
			cn = "特权",
			bn = [[Hak istimewa]],
		},
		[20018]=
		{
			id = 20018,
			cn = "已领取",
			bn = [[Sudah ambil]],
		},
		[20019]=
		{
			id = 20019,
			cn = "取消并当前回合结束执行",
			bn = [[Batalkan]],
		},
		[20020]=
		{
			id = 20020,
			cn = "确定并立即执行",
			bn = [[Tentukan]],
		},
		[20021]=
		{
			id = 20021,
			cn = "您确定要离开并退出游戏吗？",
			bn = [[Apakah yakin ingin melepaskan\npermainan dan keluar？]],
		},
		[20022]=
		{
			id = 20022,
			cn = "比赛结束时您会自动退出",
			bn = [[Permainan telah berakhir, \nanda akan keluar otomatis！]],
		},
		[20023]=
		{
			id = 20023,
			cn = "您确定要离开游戏并换桌吗？",
			bn = [[Apakah kamu yakin akan melepaskan\npermainan dan mengganti meja?]],
		},
		[20024]=
		{
			id = 20024,
			cn = "比赛结束时您会自动换桌",
			bn = [[Permainan telah berakhir, \nanda akan berganti meja secara otomatis！]],
		},
		[20025]=
		{
			id = 20025,
			cn = "您确定要离开游戏并起身吗？",
			bn = [[Apakah kamu yakin melepaskan\npermainan dan berdiri?]],
		},
		[20026]=
		{
			id = 20026,
			cn = "比赛结束时您会自动起身",
			bn = [[Permainan telah berakhir, \nanda akan berdiri secara otomatis！]],
		},
		[20027]=
		{
			id = 20027,
			cn = "正在进行中，请稍后…",
			bn = [[Masih proses, mohon ditunggu…]],
		},
		[20028]=
		{
			id = 20028,
			cn = "请等待下一轮",
			bn = [[Harap tunggu untuk ronde selanjutnya.]],
		},
		[20029]=
		{
			id = 20029,
			cn = "选择筹码数量",
			bn = [[Pilih Jumlah]],
		},
		[20030]=
		{
			id = 20030,
			cn = "携带",
			bn = [[Bawa %]],
		},
		[20031]=
		{
			id = 20031,
			cn = "过牌/弃牌",
			bn = [[Cek / Balik]],
		},
		[20032]=
		{
			id = 20032,
			cn = "过牌",
			bn = [[Cek]],
		},
		[20033]=
		{
			id = 20033,
			cn = "自动跟注",
			bn = [[Ikut Apapun]],
		},
		[20034]=
		{
			id = 20034,
			cn = "弃牌",
			bn = [[Balik]],
		},
		[20035]=
		{
			id = 20035,
			cn = "跟注",
			bn = [[Ikut]],
		},
		[20036]=
		{
			id = 20036,
			cn = "加注",
			bn = [[Naik]],
		},
		[20037]=
		{
			id = 20037,
			cn = "确定",
			bn = [[Tentukan]],
		},
		[20038]=
		{
			id = 20038,
			cn = "我的筹码",
			bn = [[Chip Saya]],
		},
		[20039]=
		{
			id = 20039,
			cn = "当筹码为0时会自动补充",
			bn = [[Ketika chip menjadi 0, akan belinya otomatis]],
		},
		[20040]=
		{
			id = 20040,
			cn = "商店",
			bn = [[Toko]],
		},
		[20041]=
		{
			id = 20041,
			cn = "兑换",
			bn = [[Tukar]],
		},
		[20042]=
		{
			id = 20042,
			cn = "盲投",
			bn = [[Buta]],
		},
		[20043]=
		{
			id = 20043,
			cn = "ALL IN后不能放弃",
			bn = [[Tidak dpt menyerah stlh ALL IN]],
		},
		[30000]=
		{
			id = 30000,
			cn = "欢迎来到多米诺大师",
			bn = [[Selamat datang di Domino Master]],
		},
		[30001]=
		{
			id = 30001,
			cn = "希望你可以在这里玩的开心！",
			bn = [[Semoga anda dapat bersenang-senang di sini!]],
		},
		[40001]=
		{
			id = 40001,
			cn = "优先出牌",
			bn = [[Main kartu dulu]],
		},
		[40002]=
		{
			id = 40002,
			cn = "过",
			bn = [[Lewat]],
		},
		[40003]=
		{
			id = 40003,
			cn = "没有牌可以打出",
			bn = [[Tidak ada kartu bisa dimainkan.]],
		},
		[40004]=
		{
			id = 40004,
			cn = "底分:",
			bn = [[Ante:]],
		},
		[40005]=
		{
			id = 40005,
			cn = "·系统托管中……\n点击屏幕可返回游戏",
			bn = [[]],
		},
		[40006]=
		{
			id = 40006,
			cn = "玩家%s输掉%s金币\n",
			bn = [[]],
		},
		[40007]=
		{
			id = 40007,
			cn = "游戏结束！\n",
			bn = [[]],
		},
		[50001]=
		{
			id = 50001,
			cn = "多米诺规则",
			bn = [[<color=#48A494>【Perkenalan】</color>\nJumlah kartu:28\nJumlah pemain:2-4 orang\nPada awal permainan setiap orang akan mendapatkan 7 kartu.\n<color=#48A494>【Peraturan】</color>\n1.Sistem akan memilih secara acak pemain yang akan mengeluarkan kartu terlebih dahulu, pemain selanjutnya didasarkan pada arah jarum jam.\n2.Nilai atas atau bawah kartu harus sama dengan ekor/kepala kartu dengan yang ada dimeja.Kartu wajib dikeluarkan jika dapat dikeluarkan.Jika tidak dapat mengeluarkan, maka mebayar pemain yang mengeluarkan kartu sebelumnya.kemudian pemain selanjutnya dapat mengeluarkan kartu.\n3.Sewaktu kartu seorang pemain sudah habis, atau sewaktu setiap pemain sudah tidak dapat mengeluarkan kartu(Dead-end), permainan berakhir.]],
		},
		[50002]=
		{
			id = 50002,
			cn = "多米诺胜利",
			bn = [[<color=#48A494>【Pemenang】</color>\n1. Pemain yang kartunya pertama kali habis adalah pemenang.\n2. Pada Dead-End,  pemain dengan total nilai terkecil adalah pemenangnya. \n3. Jika 2 orang memiliki total nilai yang sama,  maka pemain dengan total kartu paling sedikit yang menang. \n4. Jika 2 orang memiliki jumlah kartu yang sama,  maka pemain dengan poin terkecil yang menang. \n5. Jika 2 orang memiliki nilai terkecil,  maka nilai sebelah atas terkecil adalah pemenangnya.]],
		},
		[50003]=
		{
			id = 50003,
			cn = "多米诺结算",
			bn = [[<color=#48A494>【Kartu pemenang】</color>\nKartu pemenang(kartu yang terakhir dikeluarkan oleh pemenang terbagi menjadi dua jenis: Kartu kembar - nilai atas dan bawahnya sama; Kartu biasa - nilai atas dan bawahnya berbeda.\n<color=#48A494>【Lewat】</color>\nSewaktu tidak ada kartu yang cocok,  anda harus membayar kepada pemain sebelumnya sebesar 1x nilai taruhan.\n<color=#48A494>【Single】</color>\nPada kondisi Dead-End,  nilai multiplier adalah 1.\n<color=#48A494>【Double】</color>\nKalau kartu pemenang memiliki nilai atas dan bawah yang berbeda dan hanya dapat tersambung dibagian atas atau bawah,nilai multipliernya 2.\n<color=#48A494>【Triple】</color>\nKalau kartu pemenang adalah kartu kembar,  hanya tersambung dibagian atas atau bawah,  nilai multipliernya 3.\n<color=#48A494>【Quartet】\n</color>Kalau kartu pemenang adalah kartu biasa,bagian atas dan bawah tersambung,nilai multipliernya 4.\n<color=#48A494>【Qunitet】</color>\nKalau kartu pemenang adalah kartu kembar,  bagian atas dan bawahnya tersambung,  nilai multipliernya 5.\n<color=#48A494>【Skor kekalahan】</color>\nTaruhan*multiplier.]],
		},
		[50004]=
		{
			id = 50004,
			cn = "多米诺加倍规则",
			bn = [[<color=#48A494>【Perkenalan】</color>\nJumlah kartu:28\nJumlah pemain:2-4 orang\nPada awal permainan setiap orang akan mendapatkan 7 kartu.\n<color=#48A494>【Peraturan】</color>\n1.Sistem akan memilih secara acak pemain yang akan mengeluarkan kartu terlebih dahulu, pemain selanjutnya didasarkan pada arah jarum jam.\n2.Nilai atas atau bawah kartu harus sama dengan ekor/kepala kartu dengan yang ada dimeja.Kartu wajib dikeluarkan jika dapat dikeluarkan.Jika tidak dapat mengeluarkan, maka mebayar pemain yang mengeluarkan kartu sebelumnya.kemudian pemain selanjutnya dapat mengeluarkan kartu.\n3.Sewaktu kartu seorang pemain sudah habis, atau sewaktu setiap pemain sudah tidak dapat mengeluarkan kartu(Dead-end), permainan berakhir.]],
		},
		[50005]=
		{
			id = 50005,
			cn = "多米诺加倍胜利",
			bn = [[<color=#48A494>【Pemenang】</color>\n1. Pemain yang kartunya pertama kali habis adalah pemenang.\n2. Pada Dead-End,  pemain dengan total nilai terkecil adalah pemenangnya. \n3. Jika 2 orang memiliki total nilai yang sama,  maka pemain dengan total kartu paling sedikit yang menang. \n4. Jika 2 orang memiliki jumlah kartu yang sama,  maka pemain dengan poin terkecil yang menang. \n5. Jika 2 orang memiliki nilai terkecil,  maka nilai sebelah atas terkecil adalah pemenangnya.]],
		},
		[50006]=
		{
			id = 50006,
			cn = "多米诺加倍结算",
			bn = [[<color=#48A494>【Kartu pemenang】</color>\nKartu pemenang(kartu yang terakhir dikeluarkan oleh pemenan terbagi menjadi dua jenis: Kartu kembar - nilai atas dan bawahn sama; Kartu biasa - nilai atas dan bawahnya berbeda.\n<color=#48A494>【Lewat】</color>\nSewaktu tidak ada kartu yang cocok,  anda harus membayar kepada pemain sebelumnya sebesar 1x nilai taruhan.\n<color=#48A494>【Single】</color>\nPada kondisi Dead-End,  nilai multiplier adalah 1.\n<color=#48A494>【Double】</color>\nKalau kartu pemenang memiliki nilai atas dan bawah yang berbeda dan hanya dapat tersambung dibagian atas atau bawah,nilai multipliernya 2.\n<color=#48A494>【Triple】</color>\nKalau kartu pemenang adalah kartu kembar,  hanya tersambung dibagian atas atau bawah,  nilai multipliernya 3.\n<color=#48A494>【Quartet】\n</color>Kalau kartu pemenang adalah kartu biasa,bagian atas dan bawah tersambung,nilai multipliernya 4.\n<color=#48A494>【Qunitet】</color>\nKalau kartu pemenang adalah kartu kembar,  bagian atas dan bawahnya tersambung,  nilai multipliernya 5.\n<color=#48A494>【Skor kekalahan】</color>\nTaruhan*multiplier*total poin kartu ditangan.]],
		},
		[50007]=
		{
			id = 50007,
			cn = "卢多棋规则",
			bn = [[<color=#48A494>【Perkenalan】</color>\nJumlah Pemain: 2-4 orang\n<color=#48A494>【Peraturan】</color>\n1.Setiap pemain memiliki 4 token.\n2.Pemain harus melempar 6 untuk memindahkan token dari zona awal.\n3.Lemparan 6 menghasilkan lemparan ekstra. Anda dapat melempar paling banyak 3 kali berturut-turut.\n4.Pemain akan mendapatkan satu lemparan ekstra saat salah satu tokennya mencapai rumahnya.\n5.Seorang pemain yang menangkap token lain mendapatkan lemparan lain.]],
		},
		[50008]=
		{
			id = 50008,
			cn = "卢多棋胜利",
			bn = [[<color=#48A494>【Pemenang】</color>\n1.emain yang keempat tokennya mencapai kolom rumahnya akan menjadi Pemenang.\n2.Yang berikutnya mengambil posisi kedua dan seterusnya.]],
		},
		[50009]=
		{
			id = 50009,
			cn = "卢多棋结算",
			bn = [[<color=#48A494>【Settlemeng】</color>\n1.Pemenangnya mendapat poin triple bottom.\n2.Perilaku berikut bisa mendapatkan koin tambahan.\n·Bunuh\n·Capai Base\n·Combo x 3]],
		},
		[50010]=
		{
			id = 50010,
			cn = "QIUQIU规则",
			bn = [[<color=#48A494>【Perkenalan】</color>\nJumlah kartu: 28\nJumlah pemain: 2-7 orang\n<color=#48A494>【Pembagian kartu】</color>\nAwal permainan setelah setiap orang membagikan 3 kartu mengikuti urutan memasuki tahap taruhan, setelah taruhan selesai, setiap orang membagikan kembali l kartu, lalu mengikuti urutan memasuki tahap taruhan.\n<color=#48A494>【Taruhan】</color>\nSetiap babak pembagian kartu selesai babak taruhan di mulai, dalam taruhan pemain dapat memilih meninggalkan, mengikuti, atau mengangkat, koin tidak cukup dapat di taruhkan semuanya.\n<color=#48A494>【Naik】</color>\n2 kali kenaikan minimum taruhan, koin emas tidak cukup boleh ALL IN.\n<color=#48A494>【lkut】</color>\nMengikuti pemain taruhan koin, koin tidak cukup boleh langsung ALL IN.\n<color=#48A494>【Jenis kartu point】</color>\nJumlah poin diperoleh dengan menambahkan empat kartu dan dua pasangan, 0 adalah minimum dan 9. adalah yang terbesar. Jika jumlahnya lebih dari 10, hanya satu angka yang dilihat.]],
		},
		[50011]=
		{
			id = 50011,
			cn = "QIUQIU胜利",
			bn = [[<color=#48A494>【Pemenang】</color>\nPemenang jenis kartu khusus menang, dan jenis kartu biasa menentukan pemenang berdasarkan jumlah poin.\nDari Besar ke Kecil :\nSix Devil>Twin Cards>Small Cards>Big Cards>QiuQiu>Kartu Biasa\n<color=#48A494>【Kartu Spesial】</color>\n1.Six Devil: Semua nilai kartu menjadi 6, kartu spesial yang terbesar.\n2.Twin Cards:Nilai kartu di atas sama dengan yang di bawah semuanya.\n3.Small Cards: Nilai total kartu semuanya menjadi kurang dari atau same dengan 9.\n4.Big Cards : Nilai total kartu semuan ya menjadi 39 atau lebih.\n5.QiuQiu: Nilai total kartu di sebelah kiri dan kanan sama-sama menjadi 9.\n6.Kartu Biasa: kartu yang bukan kartu spesial.]],
		},
		[50012]=
		{
			id = 50012,
			cn = "QIUQIU结算",
			bn = [[<color=#48A494>【Penyelesaian】</color>\n1.Pembandingan Kartu : tipe kartu terbesar menang, kartu khusus yang sama, kelompok hadiah dibagi sama rata;\n2.Kartu biasa: jumlah poin di sebelah kiri selalu lebih besar atau sama dengan;\n3.Pemenang di sebelah kiri: Jumlah maksimum poin menang, poin maksimum adalah sama, dan jumlah maksimum poin di kemenangan kanan;\n4.Pemenang di sebelah kanan: Jumlah maksimum poin menang, poin maksimum adalah sama, dan jumlah maksimum poin di sebelah kiri menang;\n5.Menang baik kiri dan kanan: kumpulan hadiah eksklusif;\n6.Menang terpisah dari kiri ke kanan: sama dengan kumpulan hadiah.]],
		},
		[50013]=
		{
			id = 50013,
			cn = "龙虎斗规则",
			bn = [[<color=#48A494>【Pengantar Game】</color>\nPermainan Naga dan Harimau adalah game yang diwariskan dari Baccarat. Berbeda dari Baccarat bahwa pada permainan ini terdapat 2 Bandar yakni, Naga dan Harimau.Setiap game terdiri dari 8 kartu (tidak termasuk kartu KING).Setiap ronde akan membagikan kartu terlebih dahulu kepada Naga lalu ke Harimau.\n<color=#48A494>【Peraturan Bet】</color>\nPemain dapat melakukan Bet pada area taruhan yang sesuai berdasarkan prediksi mereka sendiri (yang menang).\n<color=#48A494>【Marker Road】</color>\n1.Dari sudut kiri atas, dari atas sampai bawah, setelah terisi maka akan dilist pada kolom lain.\n2.Marker road mencatat kemenangan naga, harimau dan Seri.\n3.Merah melambangkan naga menang, biru melambangkan harimau menang dan hijau melambangkan Seri.\n<color=#48A494>【Big Road】</color>\n1.Jika pemenang berbeda dari game sebelumnya, maka list akan dicatat secara terpisah.\n2.Jika salah satu pihak menang terus menerus, maka akandicatat secara berlanjut hingga pihak lain menang.\n3.Saat marker road muncul "Seri", hanya perlu menandai 1 di non- "Seri" bola terakhir. Jika "Seri"muncul dua kali berturut-turut, angka yang ditandai menjadi 2 ,Dan seterusnya.]],
		},
		[50014]=
		{
			id = 50014,
			cn = "龙虎斗胜利",
			bn = [[<color=#48A494>【Pemenang】</color>\n1.Naga dan Harimau hanya membanding besar kecil nilai yang didapatkan untuk menjadi pemenang atau sama.\n2.Ukuran nilai besar kecil adalah : A~K,A bernilai 1, palingkecil, K bernilai 13, paling besar.\n<color=#48A494>【Gelar】</color>\nKAYA：Pemain yang bawa koin terbanyak\nUNTUNG：Pemain menang terbanyak  di babak sebelumnya]],
		},
		[50015]=
		{
			id = 50015,
			cn = "龙虎斗结算",
			bn = [[<color=#48A494>【Area Bet Rasio】</color>\nNaga 1:1\nHarimau 1:1\nSeri 1:8]],
		},
		[60001]=
		{
			id = 60001,
			cn = "请前往更高级的场次进行游戏",
			bn = [[Silakan pergi ke tahap berikutnya untuk memainkan game]],
		},
		[60002]=
		{
			id = 60002,
			cn = "快速开始",
			bn = [[Mulai Cepat]],
		},
		[60003]=
		{
			id = 60003,
			cn = "未满足入场最低条件， 请前往充值",
			bn = [[Tidak memenuhi minimum persyaratan untuk masuk,  silakan Top up]],
		},
		[60004]=
		{
			id = 60004,
			cn = "前往充值",
			bn = [[Pergi Top up]],
		},
		[60005]=
		{
			id = 60005,
			cn = "未满足入场最低条件， 请前往充值或选择其他场次",
			bn = [[Tidak memenuhi syarat minimum koin untuk masuk,silakan Top up atau pilih arena lainnya]],
		},
		[60006]=
		{
			id = 60006,
			cn = "当前退出你将损失%s金币， 是否确认是否确认退出游戏？",
			bn = [[Anda akan kehilangan %s Koin jika keluar dari permainan,  tetap keluar?]],
		},
		[60007]=
		{
			id = 60007,
			cn = "取消",
			bn = [[Batalkan]],
		},
		[60008]=
		{
			id = 60008,
			cn = "确认",
			bn = [[Tentukan]],
		},
		[60009]=
		{
			id = 60009,
			cn = "系统托管中……\n点击屏幕可返回游戏",
			bn = [[Sistem sedang mengeluarkan kartu secara otomatis…\nSentuh layar untuk meneruskan permainan.]],
		},
		[60010]=
		{
			id = 60010,
			cn = "排名",
			bn = [[Peringkat]],
		},
		[60011]=
		{
			id = 60011,
			cn = "击杀数",
			bn = [[Bunuh]],
		},
		[60012]=
		{
			id = 60012,
			cn = "被击杀数",
			bn = [[Mati]],
		},
		[60013]=
		{
			id = 60013,
			cn = "收益",
			bn = [[Koin]],
		},
		[60014]=
		{
			id = 60014,
			cn = "back",
			bn = [[Lobi]],
		},
		[60015]=
		{
			id = 60015,
			cn = "next",
			bn = [[Lanjut]],
		},
		[60016]=
		{
			id = 60016,
			cn = "玩家",
			bn = [[Penmain]],
		},
		[60017]=
		{
			id = 60017,
			cn = "分数",
			bn = [[Poin]],
		},
		[60018]=
		{
			id = 60018,
			cn = "倍率",
			bn = [[Multiplier]],
		},
		[60019]=
		{
			id = 60019,
			cn = "底分",
			bn = [[Taruhan]],
		},
		[60020]=
		{
			id = 60020,
			cn = "收益情况",
			bn = [[Keuntungan]],
		},
		[60021]=
		{
			id = 60021,
			cn = "再来一局",
			bn = [[Lobi]],
		},
		[60022]=
		{
			id = 60022,
			cn = "换桌",
			bn = [[Pindah]],
		},
		[60023]=
		{
			id = 60023,
			cn = "当游戏结束， 你会自动退出！",
			bn = [[Permainan telah berakhir, \nanda akan keluar otomatis!]],
		},
		[60024]=
		{
			id = 60024,
			cn = "当游戏结束， 你会自动换桌！",
			bn = [[Permainan telah berakhir, \nanda akan berganti meja secara otomatis!]],
		},
		[60025]=
		{
			id = 60025,
			cn = "您正在%s游戏中， 是否继续游戏？",
			bn = [[Anda berada dalam permainan %s,  lanjutkan bermain?]],
		},
		[60026]=
		{
			id = 60026,
			cn = "已领取该特权礼包",
			bn = [[Sudah ambil paket hak istimewa]],
		},
		[60027]=
		{
			id = 60027,
			cn = "达到VIP%s可领取",
			bn = [[VIP%s bisa ambil]],
		},
		[60028]=
		{
			id = 60028,
			cn = "持有10M金币才可以进入该场次，请前往充值",
			bn = [[Bawa %s koin baru bisa masuk set ini, silakan top up]],
		},
		[61000]=
		{
			id = 61000,
			cn = "代替出     以外的任何元素，当出现两个或两个以上，则整列都变为WILD",
			bn = [[mengganti semua simbol kecuali         ,kalau muncul 2 atau lebih,di kolomnya semua simbol menjadi simbol WILD]],
		},
		[61001]=
		{
			id = 61001,
			cn = "元素必须在指定行伤，从左到右或从右到左出现三个或三个以上时，将得到相应的倍数",
			bn = [[Simbolnya harus berada di garis yang ditentukan,mulai dari kiri ke kanan atau kanan ke kiri, akan dapat multiplier yang sesuai]],
		},
		[61002]=
		{
			id = 61002,
			cn = "5    20次游戏\n4    10次游戏3    \n5次游戏",
			bn = [[5    20 free spin\n4    10 free spin\n3    5 free spin]],
		},
		[61003]=
		{
			id = 61003,
			cn = "1.玩家每次进行游戏时均有概率触发奖池\n2.触发奖池等级与玩家押注档次有关\n3.获得奖励以时间显示为准",
			bn = [[1.Setiap kali mulai game ada peluang memicu Jackpot\n2.Jumlah Jackpot tergantung jumlah taruhan\n3.Hadiah yang didapatkan ditentukan oleh jumlah jackpot]],
		},
		[61004]=
		{
			id = 61004,
			cn = "您正在游戏中，请在该局结束后再开启财运蛋",
			bn = [[Anda sedang dalam game,setelah game selesai membuka telur untung]],
		},
		[61005]=
		{
			id = 61005,
			cn = "财运值满后可获得以上其中一个奖励",
			bn = [[Setelah energi penuh, dapatkan salah satu hadiah di atas]],
		},
		[70001]=
		{
			id = 70001,
			cn = "确定",
			bn = [[Tentukan]],
		},
		[70002]=
		{
			id = 70002,
			cn = "取消",
			bn = [[Batalkan]],
		},
		[70003]=
		{
			id = 70003,
			cn = "发送",
			bn = [[kirim]],
		},
		[70004]=
		{
			id = 70004,
			cn = "印尼盾",
			bn = [[IDR]],
		},
		[70005]=
		{
			id = 70005,
			cn = "使用",
			bn = [[Gunakan]],
		},
		[70006]=
		{
			id = 70006,
			cn = "前往",
			bn = [[Pergi]],
		},
		[70007]=
		{
			id = 70007,
			cn = "领取",
			bn = [[Ambil]],
		},
		[70008]=
		{
			id = 70008,
			cn = "提示",
			bn = [[Pengingat]],
		},
		[80001]=
		{
			id = 80001,
			cn = "对局%s局",
			bn = [[Menantang %s babak game]],
		},
		[80002]=
		{
			id = 80002,
			cn = "QiuQiu任意场次累计消耗%s",
			bn = [[Akumulasi mengonsumsi %s set apapun di QiuQiu]],
		},
		[80003]=
		{
			id = 80003,
			cn = "累计充值%s",
			bn = [[Akumulasi top up IDR %s]],
		},
		[80004]=
		{
			id = 80004,
			cn = "第%s天",
			bn = [[Hari %s]],
		},
		[80005]=
		{
			id = 80005,
			cn = "每日限购1次",
			bn = [[Batas beli 1 kali perhari]],
		},
		[80006]=
		{
			id = 80006,
			cn = "第%s天",
			bn = [[Hari %s]],
		},
		[80007]=
		{
			id = 80007,
			cn = "VIP%s双倍",
			bn = [[VIP%s ganda]],
		},
		[80008]=
		{
			id = 80008,
			cn = "丰厚奖励待领取，最高可领取",
			bn = [[Hadiah besar menanti Anda, bisa ambil maksimum]],
		},
		[80009]=
		{
			id = 80009,
			cn = "300RP",
			bn = [[300RP]],
		},
		[80010]=
		{
			id = 80010,
			cn = "VIP1及以上等级可领取专属累计奖励",
			bn = [[VIP1 ke atas dapat ambil hadiah akumulasi eksklusif]],
		},
		[80011]=
		{
			id = 80011,
			cn = "本月累计签到%s天",
			bn = [[Akumulasi absen %s hari bulan ini]],
		},
		[80012]=
		{
			id = 80012,
			cn = "升级VIP",
			bn = [[Tingkatkan VIP]],
		},
		[80013]=
		{
			id = 80013,
			cn = "VIP%s及以上等级可领取该奖励\n是否确认提升VIP等级？",
			bn = [[Mencapai VIP1 bisa ambil hadiah ini\nKonfirmasi tingkatkan level VIP?]],
		},
		[80014]=
		{
			id = 80014,
			cn = "签到奖励",
			bn = [[Hadiah absen]],
		},
		[80015]=
		{
			id = 80015,
			cn = "普通领取",
			bn = [[Ambil]],
		},
		[80016]=
		{
			id = 80016,
			cn = "VIP%s领取",
			bn = [[VIP%s Ambil]],
		},
		[80017]=
		{
			id = 80017,
			cn = "领取抽奖券后可进行抽奖!",
			bn = [[Setelah ambil kupon undian, Anda dapat melakukan undian!]],
		},
		[80018]=
		{
			id = 80018,
			cn = "成为Vip可每日免费抽奖并且获得额外奖励!",
			bn = [[Menjadi Vip untuk undian harian gratis dan hadiah ekstra!]],
		},
		[80019]=
		{
			id = 80019,
			cn = "当日抽奖次数不足，请明日再来。注：提升Vip等级可获得更多抽奖次数和额外奖励!",
			bn = [[Kesempatan udian habis hari ini, silakan kembali besok. Catatan: Naikkan level Vip bisa tambah kesempatan undian dan hadiah ekstra!]],
		},
		[80020]=
		{
			id = 80020,
			cn = "Vip1及以上等级才可使用.",
			bn = [[Hanya VIP 1 ke atas yang dapat menggunakannya.]],
		},
		[80021]=
		{
			id = 80021,
			cn = "lv5才可使用.",
			bn = [[Lv5 hanya dapat digunakan.]],
		},
		[80022]=
		{
			id = 80022,
			cn = "当日抽奖次数不足，请明日再来。注：提升Vip等级可获得更多抽奖次数！",
			bn = [[Kesempatan udian habis hari ini , silakan kembali besok. Catatan: Naikkan level Vip bisa tambah kesempatan undian!]],
		},
		[80023]=
		{
			id = 80023,
			cn = "您携带的金币不足200M，是否前往商城获得金币？",
			bn = [[Anda memiliki koin emas kurang dari 200M, apakah Anda ingin pergi ke toko untuk mendapatkan koin emas?]],
		},
		[80024]=
		{
			id = 80024,
			cn = "随机获得金币或RP，最高可获得RP*300",
			bn = [[Dapatkan koin atau uang secara acak, bisa ambil maksimum RP*300]],
		},
		[80025]=
		{
			id = 80025,
			cn = "达到Lv%s才可以领取！",
			bn = [[Mencapai  Lv%s baru bisa ambil kupon udian, kupon udian bisa digunakan di undian wheel!]],
		},
		[80026]=
		{
			id = 80026,
			cn = "前一阶段礼包任务完成后，可购买该礼包",
			bn = [[Setelah menyelesaikan misi paket hadiah di tahap sebelumnya, paket hadiah ini dapat dibeli]],
		},
		[80027]=
		{
			id = 80027,
			cn = "Wheel 规则",
			bn = [[1.Ketika Lv mencapai 2,3,4, dan 5,Anda bisa mendapatkan 1 kupon undian,dan kupon undian dapat digunakan di undian Wheel.\n\n2.Vip bisa mendapat kesempatan undian gratis setiap hari.\n\n3.Semakin tinggi level Vip semakin banyak kesempatan undian(klik tombol Vip di Lobi lihat detailnya) dan mendapat lebih banyak hadiah.\n\n4.Level VIP memiliki dorongan ekstra untuk hadiahnya. Hadiah akhir = Wheel×multiplier hadiah VIP."]],
		},
		[80028]=
		{
			id = 80028,
			cn = "Vip Wheel 规则",
			bn = [[Semakin tinggi level vip, semakin banyak kesempatan undian Anda dapat di Vip wheel setiap hari.]],
		},
		[80029]=
		{
			id = 80029,
			cn = "购买礼包后可开启该任务",
			bn = [[Setelah membeli paket bisa membuka misi ini]],
		},
		[80030]=
		{
			id = 80030,
			cn = "全部任务已达成",
			bn = [[Semua misi selesai]],
		},
		[80031]=
		{
			id = 80031,
			cn = "胜利",
			bn = [[Hadiah kemenangan]],
		},
		[80032]=
		{
			id = 80032,
			cn = "以双倍或更多的优势获胜",
			bn = [[Menangkan Double keatas]],
		},
		[80033]=
		{
			id = 80033,
			cn = "以三倍或更多的优势获胜",
			bn = [[Menangkan Triple keatas]],
		},
		[80034]=
		{
			id = 80034,
			cn = "以四倍或更多的优势获胜",
			bn = [[Menangkan Quatra keatas]],
		},
		[80035]=
		{
			id = 80035,
			cn = "以这张牌获得胜利",
			bn = [[Menang dengan kartu ini %s]],
		},
		[80036]=
		{
			id = 80036,
			cn = "QiuQiu-Advanced场次累计消耗%s",
			bn = [[Akumulasi mengonsumsi %s di set QiuQiu-Sedang ke atas]],
		},
		[80037]=
		{
			id = 80037,
			cn = "Slots游戏累计消耗%s",
			bn = [[Akumulasi mengkonsumsi %s juta di slots]],
		},
		[80038]=
		{
			id = 80038,
			cn = "怎么解决这些问题？ 把它和FB联系起来！",
			bn = [[Duh bagaimana pecahkan masalah-masalah ini？kaitkan dng akun pihak ketiga aja!]],
		},
		[80039]=
		{
			id = 80039,
			cn = "新建成品帐户 ",
			bn = [[Akun jadi baru]],
		},
		[80040]=
		{
			id = 80040,
			cn = "遗失的旧账 ",
			bn = [[Akun lama hilang]],
		},
		[80041]=
		{
			id = 80041,
			cn = "帐目变更 ",
			bn = [[Akun berubah]],
		},
		[80042]=
		{
			id = 80042,
			cn = "访问者帐户很可能在Andorid10及以上系统中丢失，但如果与Facebook相关联，则可以恢复",
			bn = [[Akun pengunjung kemungkinan besar hilang di sistem Andorid 10 ke atas tetapi bisa dikembalikan jika sdh dikaitkan dgn akun pihak ketiga]],
		},
		[80043]=
		{
			id = 80043,
			cn = "剩余时间",
			bn = [[Sisa waktu]],
		},
		[80044]=
		{
			id = 80044,
			cn = "两种礼包只能选择一种购买",
			bn = [[Dalam 2 jenis paket hanya bisa beli 1 paket]],
		},
		[80045]=
		{
			id = 80045,
			cn = "天",
			bn = [[ hari ]],
		},
		[80046]=
		{
			id = 80046,
			cn = "小时",
			bn = [[ jam ]],
		},
		[80047]=
		{
			id = 80047,
			cn = "分钟",
			bn = [[ menit ]],
		},
		[80048]=
		{
			id = 80048,
			cn = "秒",
			bn = [[ detik ]],
		},
		[80049]=
		{
			id = 80049,
			cn = "没有足够金币",
			bn = [[koin tidak mencukupi]],
		},
		[80050]=
		{
			id = 80050,
			cn = "当局比赛结束后可领取",
			bn = [[Setelah permainan berakhir bisa ambil]],
		},
		[80051]=
		{
			id = 80051,
			cn = "数量",
			bn = [[Jumlah]],
		},
		[80052]=
		{
			id = 80052,
			cn = "退出",
			bn = [[Keluar]],
		},
		[80053]=
		{
			id = 80053,
			cn = "正在重连服务器。。。",
			bn = [[Sedang hubungkan ulang ke server…]],
		},
		[80054]=
		{
			id = 80054,
			cn = "没有足够筹码",
			bn = [[chip tidak mencukupi]],
		},
		[80055]=
		{
			id = 80055,
			cn = "您当前携带的RP已达到上限:%s，超出的%sRP将转换成%s金币！\n提升VIP等级后可增加RP携带上限！",
			bn = [[RP yang Anda bawa saat ini telah mencapai batas atas: %s, kelebihan %s RP akan diubah menjadi %s koin! \ntingkatkan level VIP dapat meningkatkan batasan bawa RP!]],
		},
		[80056]=
		{
			id = 80056,
			cn = "已经购买此商品",
			bn = [[Sudah punya produk ini]],
		},
		[80057]=
		{
			id = 80057,
			cn = "该商品暂时无法购买",
			bn = [[Produk tidak dapat beli saat ini]],
		},
		[80058]=
		{
			id = 80058,
			cn = "没有足够RP",
			bn = [[RP tidak mencukupi]],
		},
		[80059]=
		{
			id = 80059,
			cn = "是否确定消耗%sRP来兑换\n%s %s？",
			bn = [[Yakin menghabiskan %s RP untuk menukar\n%s %s?]],
		},
		[80060]=
		{
			id = 80060,
			cn = "打出特殊牌型获得RP奖励",
			bn = [[Dapatkan kartu khusus\nMenangkan hadiah RP]],
		},
		[80061]=
		{
			id = 80061,
			cn = "支付方式已升级，请重新登陆，若遇异常情况请联系客服",
			bn = [[Cara pembayaran sudah update,silakan login ulang,jika ada masalah silakan hubungi CS]],
		},
		[80062]=
		{
			id = 80062,
			cn = "当前不能支付",
			bn = [[Tidak bisa top up saat ini]],
		},
		[80063]=
		{
			id = 80063,
			cn = "购买后30s左右金币到账请耐心等待",
			bn = [[Setelah selesai beli,hampir 30 detik koin akan masuk,silakan tunggu.]],
		},
		[81000]=
		{
			id = 81000,
			cn = "同类暴击",
			bn = [[SERANGAN KRITIS SERUPA]],
		},
		[81001]=
		{
			id = 81001,
			cn = "全屏暴击",
			bn = [[SERANGAN KRITIS PENUH LAYAR]],
		},
		[81002]=
		{
			id = 81002,
			cn = "任务还未完成，不能开启宝箱",
			bn = [[Belum selesai misi,tidak bisa membuka peti harta.]],
		},
		[81003]=
		{
			id = 81003,
			cn = "长时间未操作，是否确认退出游戏？",
			bn = [[Sudah lama tidak aktif, apakah ingin keluar dari permainan?]],
		},
		[81004]=
		{
			id = 81004,
			cn = "稍后",
			bn = [[Nanti]],
		},
		[81005]=
		{
			id = 81005,
			cn = "当局游戏结束后可退出",
			bn = [[Setelah babak ini selesai bisa keluar]],
		},
		[81006]=
		{
			id = 81006,
			cn = "近20局结果统计",
			bn = [[Statistik 20 babak terakhir]],
		},
		[81007]=
		{
			id = 81007,
			cn = "局数",
			bn = [[Jumlah babak]],
		},
		[81008]=
		{
			id = 81008,
			cn = "您的性别是？",
			bn = [[Jenis kelamin Anda? ]],
		},
		[81009]=
		{
			id = 81009,
			cn = "男",
			bn = [[Lelaki]],
		},
		[81010]=
		{
			id = 81010,
			cn = "女",
			bn = [[Perempuan]],
		},
		[81011]=
		{
			id = 81011,
			cn = "您的年龄是？",
			bn = [[Berapa umur Anda?]],
		},
		[81012]=
		{
			id = 81012,
			cn = "0-25岁",
			bn = [[0-25tahun]],
		},
		[81013]=
		{
			id = 81013,
			cn = "26-35岁",
			bn = [[26-35tahun]],
		},
		[81014]=
		{
			id = 81014,
			cn = "36-45岁",
			bn = [[36-45 tahun]],
		},
		[81015]=
		{
			id = 81015,
			cn = "45岁以上",
			bn = [[45+]],
		},
		[81016]=
		{
			id = 81016,
			cn = "您玩游戏的目的是？",
			bn = [[Apa tujuan Anda bermain game?]],
		},
		[81017]=
		{
			id = 81017,
			cn = "释放压力",
			bn = [[Lepaskan stres]],
		},
		[81018]=
		{
			id = 81018,
			cn = "打发时间",
			bn = [[Menghabiskan waktu]],
		},
		[81019]=
		{
			id = 81019,
			cn = "兑换奖励",
			bn = [[Tukarkan hadiah]],
		},
		[81020]=
		{
			id = 81020,
			cn = "兴趣爱好",
			bn = [[Hobi]],
		},
		[81021]=
		{
			id = 81021,
			cn = "您目前的月收入水平？（保密）",
			bn = [[Berapa pendapatan bulanan Anda saat ini? (rahasiakan)]],
		},
		[81022]=
		{
			id = 81022,
			cn = "0-3 juta",
			bn = [[0-3 juta]],
		},
		[81023]=
		{
			id = 81023,
			cn = "3 juta～6 juta",
			bn = [[3 juta～6 juta]],
		},
		[81024]=
		{
			id = 81024,
			cn = "6 juta～10 juta",
			bn = [[6 juta～10 juta]],
		},
		[81025]=
		{
			id = 81025,
			cn = "10 juta＋",
			bn = [[10 juta＋]],
		},
		[81026]=
		{
			id = 81026,
			cn = "您曾在一款游戏中最多充过多少钱？",
			bn = [[Anda paling banyak top up berapa uang dalam game?]],
		},
		[81027]=
		{
			id = 81027,
			cn = "0-20 ribu",
			bn = [[0-20 ribu]],
		},
		[81028]=
		{
			id = 81028,
			cn = "20 ribu～300 ribu",
			bn = [[20 ribu～300 ribu]],
		},
		[81029]=
		{
			id = 81029,
			cn = "300 ribu～800 ribu",
			bn = [[300 ribu～800 ribu]],
		},
		[81030]=
		{
			id = 81030,
			cn = "800 ribu~2 juta",
			bn = [[800 ribu~2 juta]],
		},
		[81031]=
		{
			id = 81031,
			cn = "2 juta+",
			bn = [[2 juta+]],
		},
		[81032]=
		{
			id = 81032,
			cn = "您是否愿意把这款游戏推荐给朋友？",
			bn = [[Apakah Anda ingin merekomendasikan game ini ke teman Anda?]],
		},
		[81033]=
		{
			id = 81033,
			cn = "不愿意",
			bn = [[Tidak]],
		},
		[81034]=
		{
			id = 81034,
			cn = "愿意",
			bn = [[Setuju]],
		},
		[81035]=
		{
			id = 81035,
			cn = "看心情",
			bn = [[Terserah suasana hati]],
		},
		[81036]=
		{
			id = 81036,
			cn = "没有朋友",
			bn = [[Tidak punya teman]],
		},
		[81037]=
		{
			id = 81037,
			cn = "您玩游戏时是否出现以下问题？（多选）",
			bn = [[Apakah Anda menemui masalah berikut saat bermain game? (pilihan banyak)]],
		},
		[81038]=
		{
			id = 81038,
			cn = "无法支付",
			bn = [[Gagal top up]],
		},
		[81039]=
		{
			id = 81039,
			cn = "经常断线重新连接",
			bn = [[Selalu putus dan mulai ulang]],
		},
		[81040]=
		{
			id = 81040,
			cn = "游戏卡顿",
			bn = [[Game lambat、macet]],
		},
		[81041]=
		{
			id = 81041,
			cn = "游戏难度太高",
			bn = [[Game terlalu sulit]],
		},
		[81042]=
		{
			id = 81042,
			cn = "没有问题",
			bn = [[Tidak ada masalah]],
		},
		[81043]=
		{
			id = 81043,
			cn = "您希望增加哪些新游戏或新玩法？（填空）",
			bn = [[Anda berharap tambahkan jenis game apa? (Mengisi)]],
		},
		[81044]=
		{
			id = 81044,
			cn = "除了这款游戏您还经常玩哪几款游戏？（填空）",
			bn = [[Kecuali game ini Anda sering main game apa?(Mengisi)]],
		},
		[81045]=
		{
			id = 81045,
			cn = "您还有什么需吐槽的？（填空）",
			bn = [[Apakah ada saran lain?(Mengisi)]],
		},
		[81046]=
		{
			id = 81046,
			cn = "完成以下题目，可获得最高100M金币！",
			bn = [[Menjawab pertanyaan berikut,bisa dapat Max <color=#fff000ff>100M</color> koin!]],
		},
		[81047]=
		{
			id = 81047,
			cn = "最高100M",
			bn = [[Max 100M]],
		},
		[81048]=
		{
			id = 81048,
			cn = "提交",
			bn = [[Kirim]],
		},
		[81049]=
		{
			id = 81049,
			cn = "请提交后领取～",
			bn = [[Silakan ambil setelah kirim~]],
		},
		[81050]=
		{
			id = 81050,
			cn = "字数已达上限～",
			bn = [[Jumlah kalimat telah mencapai batas~]],
		},
		[81051]=
		{
			id = 81051,
			cn = "请完成所有题目后再提交～",
			bn = [[Silakan kirim setelah menjawab semua pertanyaan~]],
		},
		[81052]=
		{
			id = 81052,
			cn = "提交成功",
			bn = [[Berhasil kirim]],
		},
		[81053]=
		{
			id = 81053,
			cn = "赢金福利",
			bn = [[Bonus Menang]],
		},
		[81054]=
		{
			id = 81054,
			cn = "前往赢金",
			bn = [[Mengikuti]],
		},
		[81055]=
		{
			id = 81055,
			cn = "参与Slots游戏赢金更快",
			bn = [[Main Slots menang lebih cepat]],
		},
		[81056]=
		{
			id = 81056,
			cn = "该活动限时7天，从玩家首次登录游戏时开始计时",
			bn = [[Event ini terbatas waktu 7 hari,dihitung dari pertama hari pemain login game]],
		},
		[81057]=
		{
			id = 81057,
			cn = "QiuQiu和Battle游戏只统计纯赢",
			bn = [[QiuQiu dan Big Battle hanya dihitung pendapatan bersih]],
		},
		[81058]=
		{
			id = 81058,
			cn = "请及时领取奖励，活动结束后未领取的奖励视为自动放弃",
			bn = [[Silakan ambil hadiah tepat waktu,kalau event berakhir belum ambil dianggap auto lewatkan ]],
		},
		[81059]=
		{
			id = 81059,
			cn = "累计赢金",
			bn = [[Akumulasi menang]],
		},
		[81060]=
		{
			id = 81060,
			cn = "Google登陆错误",
			bn = [[Kesalahan login Google]],
		},
		[81061]=
		{
			id = 81061,
			cn = "明日再领",
			bn = [[Ambil besok]],
		},
		[81062]=
		{
			id = 81062,
			cn = "Google 网络不稳定，开始重连，请稍后再试。",
			bn = [[Jaringan Google tidak stabil, mulai tersambung kembali, coba lagi nanti.]],
		},
		[81063]=
		{
			id = 81063,
			cn = "Google 网络不稳定，正在重连，请稍后再试。",
			bn = [[Jaringan Google tidak stabil,sedang tersambung kembali, coba lagi nanti.]],
		},
		[81064]=
		{
			id = 81064,
			cn = "重连Google完成！",
			bn = [[Menghubungkan kembali ke Google selesai!]],
		},
		[81065]=
		{
			id = 81065,
			cn = "开始下一局",
			bn = [[Mulai set selanjutnya]],
		},
		[81066]=
		{
			id = 81066,
			cn = "庄家无法押注",
			bn = [[Bandar tidak bisa menaruh]],
		},
		[81067]=
		{
			id = 81067,
			cn = "趋势",
			bn = [[Trend]],
		},
		[81068]=
		{
			id = 81068,
			cn = "胜",
			bn = [[Menang]],
		},
		[81069]=
		{
			id = 81069,
			cn = "负",
			bn = [[Gagal]],
		},
		[81070]=
		{
			id = 81070,
			cn = "成为庄家",
			bn = [[Menjadi Bandar]],
		},
		[81071]=
		{
			id = 81071,
			cn = "庄家列表",
			bn = [[Daftar Bandar]],
		},
		[81072]=
		{
			id = 81072,
			cn = "当前没有玩家成为庄家，无需等待",
			bn = [[Saat ini tidak ada pemain menjadi Bandar,tak perlu tunggu]],
		},
		[81073]=
		{
			id = 81073,
			cn = "成为庄家需要10B",
			bn = [[Menjadi Bandar perlu 10B]],
		},
		[81074]=
		{
			id = 81074,
			cn = "队列",
			bn = [[Deretan]],
		},
		[81075]=
		{
			id = 81075,
			cn = "玩家数量较多，请稍后重试",
			bn = [[Terlalu banyak pemain,silakan mencoba nanti]],
		},
		[81076]=
		{
			id = 81076,
			cn = "已进入庄家队列中，是否确认退出游戏？",
			bn = [[Sudah masuk deretan Bandar,yakin keluar game?]],
		},
		[81077]=
		{
			id = 81077,
			cn = "是否在下一局中继续成为庄家？",
			bn = [[Terus menjadi Bandar di set selanjutnya?]],
		},
		[81078]=
		{
			id = 81078,
			cn = "已进入庄家队列中",
			bn = [[Sudah masuk deretan Bandar]],
		},
		[81079]=
		{
			id = 81079,
			cn = "前往VIP",
			bn = [[Pergi VIP]],
		},
		[81080]=
		{
			id = 81080,
			cn = "前往兑换商城\n换取超值话费卡",
			bn = [[Menukar <color=#FFF058>Kartu Pulsa</color>]],
		},
		[81081]=
		{
			id = 81081,
			cn = "RP溢出提醒",
			bn = [[Petunjuk meluap RP]],
		},
		[81082]=
		{
			id = 81082,
			cn = "当前RP上限",
			bn = [[Batas RP saat ini]],
		},
		[81083]=
		{
			id = 81083,
			cn = "当前VIP等级",
			bn = [[Level VIP saat ini]],
		},
		[81084]=
		{
			id = 81084,
			cn = "已溢出",
			bn = [[Sudah\nmeluap]],
		},
		[81085]=
		{
			id = 81085,
			cn = "溢出RP已转换为金币",
			bn = [[RP meluap terjadi koin]],
		},
		[81086]=
		{
			id = 81086,
			cn = "RP超过持有上限会转换为金币，提升VIP等级可增加RP持有上限",
			bn = [[Jika melebihi batas RP, RP akan diubah menjadi koin emas.\nMeningkatkan level VIP dapat meningkatkan batas RP.]],
		},
		[81087]=
		{
			id = 81087,
			cn = "前往兑换商城可消耗RP兑换超值礼品",
			bn = [[Pindah ke Exchange bisa menggunakan\nRP tukar hadiah berharga]],
		},
		[81088]=
		{
			id = 81088,
			cn = "提升VIP",
			bn = [[Tingkatkan VIP]],
		},
		[81089]=
		{
			id = 81089,
			cn = "兑换礼品",
			bn = [[Menukar hadiah]],
		},
		[81090]=
		{
			id = 81090,
			cn = "可兑换话费卡",
			bn = [[Bisa tukar kartu pulsa]],
		},
		[81091]=
		{
			id = 81091,
			cn = "完成以下所有任务",
			bn = [[Selesai semua misi berikut]],
		},
		[81092]=
		{
			id = 81092,
			cn = "Exchange中完成一次兑换",
			bn = [[Selesaikan 1 kali pertukaran di Exchange]],
		},
		[81093]=
		{
			id = 81093,
			cn = "Domino Classic 任意场次玩5局",
			bn = [[Main 5 set di Domino Classic]],
		},
		[81094]=
		{
			id = 81094,
			cn = "Domino Bet 任意场次玩5局",
			bn = [[Main 5 set di Domino Bet]],
		},
		[81095]=
		{
			id = 81095,
			cn = "QiuQiu 任意场次玩5局",
			bn = [[Main 5 set di QiuQiu]],
		},
		[81096]=
		{
			id = 81096,
			cn = "DATTLE BIG 押注10次",
			bn = [[Bet 10 kali di Big Battle]],
		},
		[81097]=
		{
			id = 81097,
			cn = "Slots 累计赢金10M",
			bn = [[Akumulasi menang 10M di Slots]],
		},
		[81098]=
		{
			id = 81098,
			cn = "参与一次Wheel抽奖",
			bn = [[Melakukan 1 kali undian Wheel]],
		},
		[81099]=
		{
			id = 81099,
			cn = "玩游戏，领福利",
			bn = [[Main game,ambil hadiah]],
		},
		[81100]=
		{
			id = 81100,
			cn = "游戏福利",
			bn = [[Bonus game]],
		},
		[81101]=
		{
			id = 81101,
			cn = "累计赢金抽大奖",
			bn = [[Akumulasi menang undian besar]],
		},
		[81102]=
		{
			id = 81102,
			cn = "每累计赢1M鲸币，获得1积分",
			bn = [[Setiap akumulasi menang 1M koin,dapatkan 1 poin]],
		},
		[81103]=
		{
			id = 81103,
			cn = "当前积分",
			bn = [[Poin saat ini]],
		},
		[81104]=
		{
			id = 81104,
			cn = "消耗1000积分",
			bn = [[Konsumsi 1000 poin]],
		},
		[81105]=
		{
			id = 81105,
			cn = "积分不足",
			bn = [[Poin tidak cukup]],
		},
		[81106]=
		{
			id = 81106,
			cn = "赢金抽奖",
			bn = [[Udian menang]],
		},
		[81107]=
		{
			id = 81107,
			cn = "OPPO手机",
			bn = [[OPPO A16]],
		},
		[81108]=
		{
			id = 81108,
			cn = "请联系WA：089510304176领取实物奖励。",
			bn = [[Silakan hubungi WA: 089510304176 ambil hadiah]],
		},
		[81109]=
		{
			id = 81109,
			cn = "立即获得VIP1特权",
			bn = [[Dapatkan hak istimewa VIP1]],
		},
		[81110]=
		{
			id = 81110,
			cn = "10K RP可在兑换商城兑换10K话费",
			bn = [[Sejumlah 10K RP bisa tukar 10K pulsa di Exchange]],
		},
		[81111]=
		{
			id = 81111,
			cn = "点击复制",
			bn = [[Klik salin]],
		},
		[81112]=
		{
			id = 81112,
			cn = "复制成功",
			bn = [[Sukses salin]],
		},
		[81113]=
		{
			id = 81113,
			cn = "查看",
			bn = [[Lihat]],
		},
		[81114]=
		{
			id = 81114,
			cn = "欢迎来到Domino的世界特为您奉上起航奖励请笑纳！",
			bn = [[Selamat datang di dunia Domino Master, sudah siapkan hadiah khusus untuk Anda, terimalah!]],
		},
		[81115]=
		{
			id = 81115,
			cn = "金币赠送",
			bn = [[Kirim koin]],
		},
		[81116]=
		{
			id = 81116,
			cn = "当前金币数",
			bn = [[Jumlah koin]],
		},
		[81117]=
		{
			id = 81117,
			cn = "今日剩余赠送次数",
			bn = [[Sisa jumlah kirim hari ini]],
		},
		[81118]=
		{
			id = 81118,
			cn = "玩家ID",
			bn = [[ID pemain]],
		},
		[81119]=
		{
			id = 81119,
			cn = "输入玩家ID赠送金币",
			bn = [[Masukkan ID pemain kirim koin]],
		},
		[81120]=
		{
			id = 81120,
			cn = "赠送金额",
			bn = [[Jumlah kirim]],
		},
		[81121]=
		{
			id = 81121,
			cn = "赠送",
			bn = [[Kirim]],
		},
		[81122]=
		{
			id = 81122,
			cn = "◆提升VIP等级，可提高每日赠送次数。◆获得金币赠送的玩家，可通过邮件收到获赠的金币。",
			bn = [[◆Tingkatkan level VIP bisa tambahkan jumlah kirim\n◆Pemain yang dikirim koin bisa ambil koinnya di Inbox.]],
		},
		[81123]=
		{
			id = 81123,
			cn = "请输入正确的玩家ID",
			bn = [[Silakan masukkan ID yang benar]],
		},
		[81124]=
		{
			id = 81124,
			cn = "请选择赠送金额",
			bn = [[Silakan pilih jumlah ID]],
		},
		[81125]=
		{
			id = 81125,
			cn = "今日赠送次数不足",
			bn = [[Jumlah kirim hari ini tidak cukup]],
		},
		[81126]=
		{
			id = 81126,
			cn = "赠送成功",
			bn = [[Kirim sukses]],
		},
		[81127]=
		{
			id = 81127,
			cn = "获得玩家xxx赠送的金币",
			bn = [[Mendapat koin %s dari pemain %s.]],
		},
		[81128]=
		{
			id = 81128,
			cn = "VIPx解锁",
			bn = [[Membuka VIP%]],
		},
		[81129]=
		{
			id = 81129,
			cn = "累计赢金排行榜",
			bn = [[Peringkat akumulasi menang]],
		},
		[81130]=
		{
			id = 81130,
			cn = "恭喜您在累计赢金排行榜中获得了第n名，xxx排名奖励请查收。",
			bn = [[Selamat Anda telah memenangkan posisi ke-%s dalam peringkat pemenang akumulasi. Silakan periksa hadiah peringkat RP %s.]],
		},
		[81131]=
		{
			id = 81131,
			cn = "名次",
			bn = [[Peringkat]],
		},
		[81132]=
		{
			id = 81132,
			cn = "昵称",
			bn = [[Nama]],
		},
		[81133]=
		{
			id = 81133,
			cn = "赢金数量",
			bn = [[Jumlah kemenangan]],
		},
		[81134]=
		{
			id = 81134,
			cn = "排行榜奖励",
			bn = [[Hadiah peringkat]],
		},
		[81135]=
		{
			id = 81135,
			cn = "赢金排行榜",
			bn = [[Peringkat kemenangan]],
		},
		[81136]=
		{
			id = 81136,
			cn = "统计在所有游戏中的累计赢金数据。",
			bn = [[Statistik kemenangan akumulasi di semua game.]],
		},
		[81137]=
		{
			id = 81137,
			cn = "赢金排行榜规则",
			bn = [[1. Waktu event: 7:00 29 March s/d 23:59:59 4 April.\n\n2. Selama event, QiuQiu dan Big battle hanya menghitung data penghasilan bersih, dan game lain akan menghitung data kemenangan.\n\n3. Setelah event selesai, hadiah peringkat akan dikirim melalui email, mohon cek waktu tepat.]],
		},
		[81138]=
		{
			id = 81138,
			cn = "未上榜",
			bn = [[No Rank]],
		},
	},
}